# Biliteracy Seal

In this Jupyter notebook students' eligibility for the State Seal of Biliteracy will be calculated by loading in the cleaned transcript file for Class Grade Corrections for ILP as well as the state assessment data for SBAC and the most recent ELPAC for students that are still English Language Learners. The students GPA in their Spanish courses will be calculated, the GPA for their top four ELA classes will be calculated, whether they Met the SBAC or not will be looked at, and if they are an EL students it will look at their performance on the Oral part of the test. Students will be filtered down to just the Spanish 3 students and they will then be looked at if they met the English requirement (3.0 GPA or SBAC Met), Spanish requirement (3.0 GPA) and if they are EL they met on the Oral portion of ELPAC.

In [105]:
import numpy as np
import pandas as pd

In [106]:
# LIST STU SC ID CID LN FN GR LF 
roster = pd.read_excel(r"C:\Users\derek.castleman\Desktop\Roster Biliteracy.xlsx")

# From Course Correction for ILP Jupyter notebook
transcripts = pd.read_csv(r"C:\Users\derek.castleman\Desktop\Fixed Transcripts.csv")

# Raw Cers file for state tests
tests = pd.read_csv(r"C:\Users\derek.castleman\Desktop\Joie Stuff\CERS_SBAC_2023-24_6_20_24ALL.csv")

# LIST STU ID TST TST.ID TST.PT TST.PL TST.TD 
elpac = pd.read_excel(r"C:\Users\derek.castleman\Desktop\elpac.xlsx")

C:\Users\derek.castleman\Anaconda3\lib\site-packages\openpyxl\styles\stylesheet.py:226: UserWarning: Workbook contains no default style, apply openpyxl's default
  warn("Workbook contains no default style, apply openpyxl's default")

In [107]:
transcripts

,Student ID,Student Name,Grade,Course#,Course,Term,Year,Mark,CSU Req,Sch Taken,UC Req1,Dept,Crs Lvl
0,1092408,"Garcia Robles, Daisy",7,LH106,ART 1,2,18,A,F,6,NaN,NaN,NaN
1,1092420,"Barboza, Destinee",7,LH106,ART 1,2,18,A,F,6,NaN,NaN,NaN
2,1092441,"Acosta, Clarissa",7,LH106,ART 1,2,18,A,F,6,NaN,NaN,NaN
3,1092442,"Aguilar, Jesus",7,LH106,ART 1,2,18,A,F,6,NaN,NaN,NaN
4,1092443,"Brown, Nadya",7,LH106,ART 1,2,18,A,F,6,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
16447,1096738,"Hernandez Garcia, Alex",9,11001,Spanish 1,1,24,B,E,8,NaN,NaN,NaN
16448,1096745,"Bartolo, Olivia",9,2010,Alg 1,1,24,B,C,1,NaN,NaN,NaN
16449,1096745,"Bartolo, Olivia",9,5027,Digital Art,1,24,C,F,1,NaN,NaN,NaN
16450,1096745,"Bartolo, Olivia",9,1000,Lang Arts 9,1,24,C+,B,1,NaN,NaN,NaN
16451,1096745,"Bartolo, Olivia",9,11001,Spanish 1,1,24,C,E,1,NaN,NaN,NaN

## Spanish

The first part will filter the Spanish courses out of the transcripts and calculate the GPA for those courses that the students have taken.

In [108]:
# Selecting foreing language classes
spanish = transcripts[transcripts['CSU Req'] == 'E']
spanish

,Student ID,Student Name,Grade,Course#,Course,Term,Year,Mark,CSU Req,Sch Taken,UC Req1,Dept,Crs Lvl
25,1092536,"Cabezas Mendoza, Destiny",9,11001,Spanish 1,1,24,B,E,8,NaN,NaN,NaN
35,1092539,"Escalante, Anthony",9,11001,Spanish 1,1,24,A,E,8,NaN,NaN,NaN
44,1092542,"Naranjo Villasana, Jesus",9,11001,Spanish 1,1,24,A,E,8,NaN,NaN,NaN
48,1092543,"Negrete Elizarraras, Daniela",9,11001,Spanish 1,1,24,B+,E,8,NaN,NaN,NaN
63,1092547,"Rodriguez Almanza, Alexander",9,11001,Spanish 1,1,24,B,E,8,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
16416,1096642,"Damaso, Valeria",9,11001,Spanish 1,1,24,A,E,8,NaN,NaN,NaN
16423,1096718,"Soriano, Giro",9,11001,Spanish 1,1,24,A,E,1,NaN,NaN,NaN
16427,1096726,"Torres, Kaitelynn",9,11001,Spanish 1,1,24,B,E,1,NaN,NaN,NaN
16447,1096738,"Hernandez Garcia, Alex",9,11001,Spanish 1,1,24,B,E,8,NaN,NaN,NaN
16451,1096745,"Bartolo, Olivia",9,11001,Spanish 1,1,24,C,E,1,NaN,NaN,NaN

In [109]:
# Selecting out any that are Spanish
spanish = spanish[spanish['Course'].str.contains('spa', case=False, na=False)]
spanish

,Student ID,Student Name,Grade,Course#,Course,Term,Year,Mark,CSU Req,Sch Taken,UC Req1,Dept,Crs Lvl
25,1092536,"Cabezas Mendoza, Destiny",9,11001,Spanish 1,1,24,B,E,8,NaN,NaN,NaN
35,1092539,"Escalante, Anthony",9,11001,Spanish 1,1,24,A,E,8,NaN,NaN,NaN
44,1092542,"Naranjo Villasana, Jesus",9,11001,Spanish 1,1,24,A,E,8,NaN,NaN,NaN
48,1092543,"Negrete Elizarraras, Daniela",9,11001,Spanish 1,1,24,B+,E,8,NaN,NaN,NaN
63,1092547,"Rodriguez Almanza, Alexander",9,11001,Spanish 1,1,24,B,E,8,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
16416,1096642,"Damaso, Valeria",9,11001,Spanish 1,1,24,A,E,8,NaN,NaN,NaN
16423,1096718,"Soriano, Giro",9,11001,Spanish 1,1,24,A,E,1,NaN,NaN,NaN
16427,1096726,"Torres, Kaitelynn",9,11001,Spanish 1,1,24,B,E,1,NaN,NaN,NaN
16447,1096738,"Hernandez Garcia, Alex",9,11001,Spanish 1,1,24,B,E,8,NaN,NaN,NaN
16451,1096745,"Bartolo, Olivia",9,11001,Spanish 1,1,24,C,E,1,NaN,NaN,NaN

### BC Spanish Courses

The BC Spanish course actually counts as two grades since it is a year class. The BC courses will be selected out and then duplicated to represent this full year representation.

In [110]:
# Selecting the non-bc courses
non_bc = spanish[spanish['Crs Lvl'] != 24]
non_bc

,Student ID,Student Name,Grade,Course#,Course,Term,Year,Mark,CSU Req,Sch Taken,UC Req1,Dept,Crs Lvl
25,1092536,"Cabezas Mendoza, Destiny",9,11001,Spanish 1,1,24,B,E,8,NaN,NaN,NaN
35,1092539,"Escalante, Anthony",9,11001,Spanish 1,1,24,A,E,8,NaN,NaN,NaN
44,1092542,"Naranjo Villasana, Jesus",9,11001,Spanish 1,1,24,A,E,8,NaN,NaN,NaN
48,1092543,"Negrete Elizarraras, Daniela",9,11001,Spanish 1,1,24,B+,E,8,NaN,NaN,NaN
63,1092547,"Rodriguez Almanza, Alexander",9,11001,Spanish 1,1,24,B,E,8,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
16416,1096642,"Damaso, Valeria",9,11001,Spanish 1,1,24,A,E,8,NaN,NaN,NaN
16423,1096718,"Soriano, Giro",9,11001,Spanish 1,1,24,A,E,1,NaN,NaN,NaN
16427,1096726,"Torres, Kaitelynn",9,11001,Spanish 1,1,24,B,E,1,NaN,NaN,NaN
16447,1096738,"Hernandez Garcia, Alex",9,11001,Spanish 1,1,24,B,E,8,NaN,NaN,NaN
16451,1096745,"Bartolo, Olivia",9,11001,Spanish 1,1,24,C,E,1,NaN,NaN,NaN

In [111]:
# Selecting the BC courses
bc = spanish[spanish['Crs Lvl'] == 24]
bc

,Student ID,Student Name,Grade,Course#,Course,Term,Year,Mark,CSU Req,Sch Taken,UC Req1,Dept,Crs Lvl
329,1093046,"Gaytan Tapia, Kevin",10,11008,SPAN B1,1,24,F,E,1024,E,10.0,24.0
348,1093050,"Gonzalez Ayerdi, Samira",10,11008,SPAN B1,1,24,D,E,1024,E,10.0,24.0
360,1093051,"Hernandez, Raul",10,11008,SPAN B1,1,24,B,E,1024,E,10.0,24.0
378,1093053,"Lara Zambrano, Jonathan",10,11008,SPAN B1,1,24,A,E,1024,E,10.0,24.0
396,1093054,"Martinez, Erick",10,11008,SPAN B1,1,24,D,E,1024,E,10.0,24.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
15662,1096031,"Zamora, Melanie",10,11008,SPAN B1,1,24,B,E,1024,E,10.0,24.0
15754,1096074,"Hernandez, Edgar",11,11008,SPAN B1,1,24,A,E,1024,E,10.0,24.0
15842,1096243,"Prieto, Caleb",10,11008,SPAN B1,1,24,A,E,1024,E,10.0,24.0
15875,1096244,"Legaspi, Gian",11,11008,SPAN B1,1,23,A,E,1024,E,10.0,24.0
16232,1096341,"Yanez, Estiven",10,11008,SPAN B1,1,24,W,E,1024,E,10.0,24.0

In [112]:
# Doubling the BC courses
bc = pd.concat([bc, bc])
bc

,Student ID,Student Name,Grade,Course#,Course,Term,Year,Mark,CSU Req,Sch Taken,UC Req1,Dept,Crs Lvl
329,1093046,"Gaytan Tapia, Kevin",10,11008,SPAN B1,1,24,F,E,1024,E,10.0,24.0
348,1093050,"Gonzalez Ayerdi, Samira",10,11008,SPAN B1,1,24,D,E,1024,E,10.0,24.0
360,1093051,"Hernandez, Raul",10,11008,SPAN B1,1,24,B,E,1024,E,10.0,24.0
378,1093053,"Lara Zambrano, Jonathan",10,11008,SPAN B1,1,24,A,E,1024,E,10.0,24.0
396,1093054,"Martinez, Erick",10,11008,SPAN B1,1,24,D,E,1024,E,10.0,24.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
15662,1096031,"Zamora, Melanie",10,11008,SPAN B1,1,24,B,E,1024,E,10.0,24.0
15754,1096074,"Hernandez, Edgar",11,11008,SPAN B1,1,24,A,E,1024,E,10.0,24.0
15842,1096243,"Prieto, Caleb",10,11008,SPAN B1,1,24,A,E,1024,E,10.0,24.0
15875,1096244,"Legaspi, Gian",11,11008,SPAN B1,1,23,A,E,1024,E,10.0,24.0
16232,1096341,"Yanez, Estiven",10,11008,SPAN B1,1,24,W,E,1024,E,10.0,24.0

In [113]:
# Adding the Non-BC to the BC to get all classes again
spanish = pd.concat([non_bc, bc])
spanish

,Student ID,Student Name,Grade,Course#,Course,Term,Year,Mark,CSU Req,Sch Taken,UC Req1,Dept,Crs Lvl
25,1092536,"Cabezas Mendoza, Destiny",9,11001,Spanish 1,1,24,B,E,8,NaN,NaN,NaN
35,1092539,"Escalante, Anthony",9,11001,Spanish 1,1,24,A,E,8,NaN,NaN,NaN
44,1092542,"Naranjo Villasana, Jesus",9,11001,Spanish 1,1,24,A,E,8,NaN,NaN,NaN
48,1092543,"Negrete Elizarraras, Daniela",9,11001,Spanish 1,1,24,B+,E,8,NaN,NaN,NaN
63,1092547,"Rodriguez Almanza, Alexander",9,11001,Spanish 1,1,24,B,E,8,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
15662,1096031,"Zamora, Melanie",10,11008,SPAN B1,1,24,B,E,1024,E,10.0,24.0
15754,1096074,"Hernandez, Edgar",11,11008,SPAN B1,1,24,A,E,1024,E,10.0,24.0
15842,1096243,"Prieto, Caleb",10,11008,SPAN B1,1,24,A,E,1024,E,10.0,24.0
15875,1096244,"Legaspi, Gian",11,11008,SPAN B1,1,23,A,E,1024,E,10.0,24.0
16232,1096341,"Yanez, Estiven",10,11008,SPAN B1,1,24,W,E,1024,E,10.0,24.0

### Spanish GPA

In this section the GPA for all of the Spanish classes taken will be calculated. It will be done by filtering them out by A's (a point value of 4, B's (value of 3), C's (value of 2), D's (value of 1), and F's with no value. The GPA will be calculated by dividing the total points earned by the number of semesters that a student has taken.

In [114]:
# Gives a value of 1 for each semester taken
spanish['Spanish Semesters'] = 1
spanish

,Student ID,Student Name,Grade,Course#,Course,Term,Year,Mark,CSU Req,Sch Taken,UC Req1,Dept,Crs Lvl,Spanish Semesters
25,1092536,"Cabezas Mendoza, Destiny",9,11001,Spanish 1,1,24,B,E,8,NaN,NaN,NaN,1
35,1092539,"Escalante, Anthony",9,11001,Spanish 1,1,24,A,E,8,NaN,NaN,NaN,1
44,1092542,"Naranjo Villasana, Jesus",9,11001,Spanish 1,1,24,A,E,8,NaN,NaN,NaN,1
48,1092543,"Negrete Elizarraras, Daniela",9,11001,Spanish 1,1,24,B+,E,8,NaN,NaN,NaN,1
63,1092547,"Rodriguez Almanza, Alexander",9,11001,Spanish 1,1,24,B,E,8,NaN,NaN,NaN,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
15662,1096031,"Zamora, Melanie",10,11008,SPAN B1,1,24,B,E,1024,E,10.0,24.0,1
15754,1096074,"Hernandez, Edgar",11,11008,SPAN B1,1,24,A,E,1024,E,10.0,24.0,1
15842,1096243,"Prieto, Caleb",10,11008,SPAN B1,1,24,A,E,1024,E,10.0,24.0,1
15875,1096244,"Legaspi, Gian",11,11008,SPAN B1,1,23,A,E,1024,E,10.0,24.0,1
16232,1096341,"Yanez, Estiven",10,11008,SPAN B1,1,24,W,E,1024,E,10.0,24.0,1

In [115]:
# A grades are chosen
spanish_a = spanish[(spanish['Mark'] == 'A+') | (spanish['Mark'] == 'A') | (spanish['Mark'] == 'A-')]
spanish_a

,Student ID,Student Name,Grade,Course#,Course,Term,Year,Mark,CSU Req,Sch Taken,UC Req1,Dept,Crs Lvl,Spanish Semesters
35,1092539,"Escalante, Anthony",9,11001,Spanish 1,1,24,A,E,8,NaN,NaN,NaN,1
44,1092542,"Naranjo Villasana, Jesus",9,11001,Spanish 1,1,24,A,E,8,NaN,NaN,NaN,1
145,1092814,"Martinez Carranza, Estefhanny",9,11001,Spanish 1,1,24,A+,E,8,NaN,NaN,NaN,1
163,1092988,"Camacho Hernandez, Ana Valeria",9,11001,Spanish 1,1,24,A+,E,1,NaN,NaN,NaN,1
171,1092993,"Castaneda, Valerie",9,11001,Spanish 1,1,24,A,E,1,NaN,NaN,NaN,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
15411,1095975,"Puga, Brianna",12,11008,SPAN B1,2,23,A,E,1024,E,10.0,24.0,1
15506,1095985,"Morillo, Kristen Madison",11,11008,SPAN B1,1,23,A,E,1024,E,10.0,24.0,1
15754,1096074,"Hernandez, Edgar",11,11008,SPAN B1,1,24,A,E,1024,E,10.0,24.0,1
15842,1096243,"Prieto, Caleb",10,11008,SPAN B1,1,24,A,E,1024,E,10.0,24.0,1
15875,1096244,"Legaspi, Gian",11,11008,SPAN B1,1,23,A,E,1024,E,10.0,24.0,1

In [116]:
# A value of 4 is given to A
spanish_a['Points'] = 4
spanish_a

C:\Users\DEREK~1.CAS\AppData\Local\Temp/ipykernel_19240/922454996.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  spanish_a['Points'] = 4

,Student ID,Student Name,Grade,Course#,Course,Term,Year,Mark,CSU Req,Sch Taken,UC Req1,Dept,Crs Lvl,Spanish Semesters,Points
35,1092539,"Escalante, Anthony",9,11001,Spanish 1,1,24,A,E,8,NaN,NaN,NaN,1,4
44,1092542,"Naranjo Villasana, Jesus",9,11001,Spanish 1,1,24,A,E,8,NaN,NaN,NaN,1,4
145,1092814,"Martinez Carranza, Estefhanny",9,11001,Spanish 1,1,24,A+,E,8,NaN,NaN,NaN,1,4
163,1092988,"Camacho Hernandez, Ana Valeria",9,11001,Spanish 1,1,24,A+,E,1,NaN,NaN,NaN,1,4
171,1092993,"Castaneda, Valerie",9,11001,Spanish 1,1,24,A,E,1,NaN,NaN,NaN,1,4
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
15411,1095975,"Puga, Brianna",12,11008,SPAN B1,2,23,A,E,1024,E,10.0,24.0,1,4
15506,1095985,"Morillo, Kristen Madison",11,11008,SPAN B1,1,23,A,E,1024,E,10.0,24.0,1,4
15754,1096074,"Hernandez, Edgar",11,11008,SPAN B1,1,24,A,E,1024,E,10.0,24.0,1,4
15842,1096243,"Prieto, Caleb",10,11008,SPAN B1,1,24,A,E,1024,E,10.0,24.0,1,4
15875,1096244,"Legaspi, Gian",11,11008,SPAN B1,1,23,A,E,1024,E,10.0,24.0,1,4

In [117]:
# The B grades are chosen
spanish_b = spanish[(spanish['Mark'] == 'B+') | (spanish['Mark'] == 'B') | (spanish['Mark'] == 'B-')]
spanish_b

,Student ID,Student Name,Grade,Course#,Course,Term,Year,Mark,CSU Req,Sch Taken,UC Req1,Dept,Crs Lvl,Spanish Semesters
25,1092536,"Cabezas Mendoza, Destiny",9,11001,Spanish 1,1,24,B,E,8,NaN,NaN,NaN,1
48,1092543,"Negrete Elizarraras, Daniela",9,11001,Spanish 1,1,24,B+,E,8,NaN,NaN,NaN,1
63,1092547,"Rodriguez Almanza, Alexander",9,11001,Spanish 1,1,24,B,E,8,NaN,NaN,NaN,1
101,1092554,"Valencia, Santiago",9,11001,Spanish 1,1,24,B,E,8,NaN,NaN,NaN,1
105,1092562,"Barrientos Negrete, Jesus",9,11001,Spanish 1,1,24,B,E,8,NaN,NaN,NaN,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
15015,1095948,"Heredia, Sarah",11,11008,SPAN B1,1,23,B,E,1024,E,10.0,24.0,1
15128,1095951,"Guerrero, Delaney",12,11008,SPAN B1,1,23,B,E,1024,E,10.0,24.0,1
15382,1095968,"Plascencia Chavez, Evelyn",10,11008,SPAN B1,1,24,B,E,1024,E,10.0,24.0,1
15574,1095988,"Lopez Diaz, Maritza",12,11008,SPAN B1,2,22,B,E,1024,E,10.0,24.0,1
15662,1096031,"Zamora, Melanie",10,11008,SPAN B1,1,24,B,E,1024,E,10.0,24.0,1

In [118]:
# A value of 3 is given to Bs
spanish_b['Points'] = 3
spanish_b

C:\Users\DEREK~1.CAS\AppData\Local\Temp/ipykernel_19240/238301397.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  spanish_b['Points'] = 3

,Student ID,Student Name,Grade,Course#,Course,Term,Year,Mark,CSU Req,Sch Taken,UC Req1,Dept,Crs Lvl,Spanish Semesters,Points
25,1092536,"Cabezas Mendoza, Destiny",9,11001,Spanish 1,1,24,B,E,8,NaN,NaN,NaN,1,3
48,1092543,"Negrete Elizarraras, Daniela",9,11001,Spanish 1,1,24,B+,E,8,NaN,NaN,NaN,1,3
63,1092547,"Rodriguez Almanza, Alexander",9,11001,Spanish 1,1,24,B,E,8,NaN,NaN,NaN,1,3
101,1092554,"Valencia, Santiago",9,11001,Spanish 1,1,24,B,E,8,NaN,NaN,NaN,1,3
105,1092562,"Barrientos Negrete, Jesus",9,11001,Spanish 1,1,24,B,E,8,NaN,NaN,NaN,1,3
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
15015,1095948,"Heredia, Sarah",11,11008,SPAN B1,1,23,B,E,1024,E,10.0,24.0,1,3
15128,1095951,"Guerrero, Delaney",12,11008,SPAN B1,1,23,B,E,1024,E,10.0,24.0,1,3
15382,1095968,"Plascencia Chavez, Evelyn",10,11008,SPAN B1,1,24,B,E,1024,E,10.0,24.0,1,3
15574,1095988,"Lopez Diaz, Maritza",12,11008,SPAN B1,2,22,B,E,1024,E,10.0,24.0,1,3
15662,1096031,"Zamora, Melanie",10,11008,SPAN B1,1,24,B,E,1024,E,10.0,24.0,1,3

In [119]:
# The C grades are selected
spanish_c = spanish[(spanish['Mark'] == 'C+') | (spanish['Mark'] == 'C') | (spanish['Mark'] == 'C-')]
spanish_c

,Student ID,Student Name,Grade,Course#,Course,Term,Year,Mark,CSU Req,Sch Taken,UC Req1,Dept,Crs Lvl,Spanish Semesters
211,1093011,"Lopez Vargas, Ariann",9,11001,Spanish 1,1,24,C+,E,1,NaN,NaN,NaN,1
217,1093012,"Mendoza Ruelas, Andrew",9,11001,Spanish 1,1,24,C,E,1,NaN,NaN,NaN,1
222,1093014,"Padilla, Matthew",9,11001,Spanish 1,1,24,C,E,1,NaN,NaN,NaN,1
296,1093038,"Rivera Montano, Noel",9,11001,Spanish 1,1,24,C,E,1,NaN,NaN,NaN,1
430,1093056,"Mendez, Lorenzo",10,11001,Spanish 1,1,24,C,E,1,NaN,NaN,NaN,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
13777,1095544,"Lopez Bojorquez, Marilin",10,11008,SPAN B1,1,24,C,E,1024,E,10.0,24.0,1
13811,1095547,"Martinez, Camille",10,11008,SPAN B1,1,24,C,E,1024,E,10.0,24.0,1
14269,1095642,"Garcia Torres, Abigail",10,11008,SPAN B1,1,24,C,E,1024,E,10.0,24.0,1
14340,1095677,"Herrera Casillas, Maria",10,11008,SPAN B1,1,24,C,E,1024,E,10.0,24.0,1
14701,1095886,"Villegas, Isabel",11,11008,SPAN B1,2,23,C,E,1024,E,10.0,24.0,1

In [120]:
# A value of 2 is given to C grades
spanish_c['Points'] = 2
spanish_c

C:\Users\DEREK~1.CAS\AppData\Local\Temp/ipykernel_19240/1586662613.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  spanish_c['Points'] = 2

,Student ID,Student Name,Grade,Course#,Course,Term,Year,Mark,CSU Req,Sch Taken,UC Req1,Dept,Crs Lvl,Spanish Semesters,Points
211,1093011,"Lopez Vargas, Ariann",9,11001,Spanish 1,1,24,C+,E,1,NaN,NaN,NaN,1,2
217,1093012,"Mendoza Ruelas, Andrew",9,11001,Spanish 1,1,24,C,E,1,NaN,NaN,NaN,1,2
222,1093014,"Padilla, Matthew",9,11001,Spanish 1,1,24,C,E,1,NaN,NaN,NaN,1,2
296,1093038,"Rivera Montano, Noel",9,11001,Spanish 1,1,24,C,E,1,NaN,NaN,NaN,1,2
430,1093056,"Mendez, Lorenzo",10,11001,Spanish 1,1,24,C,E,1,NaN,NaN,NaN,1,2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
13777,1095544,"Lopez Bojorquez, Marilin",10,11008,SPAN B1,1,24,C,E,1024,E,10.0,24.0,1,2
13811,1095547,"Martinez, Camille",10,11008,SPAN B1,1,24,C,E,1024,E,10.0,24.0,1,2
14269,1095642,"Garcia Torres, Abigail",10,11008,SPAN B1,1,24,C,E,1024,E,10.0,24.0,1,2
14340,1095677,"Herrera Casillas, Maria",10,11008,SPAN B1,1,24,C,E,1024,E,10.0,24.0,1,2
14701,1095886,"Villegas, Isabel",11,11008,SPAN B1,2,23,C,E,1024,E,10.0,24.0,1,2

In [121]:
# The D grades are selected
spanish_d = spanish[(spanish['Mark'] == 'D+') | (spanish['Mark'] == 'D') | (spanish['Mark'] == 'D-')]
spanish_d

,Student ID,Student Name,Grade,Course#,Course,Term,Year,Mark,CSU Req,Sch Taken,UC Req1,Dept,Crs Lvl,Spanish Semesters
67,1092548,"Rodriguez Juarez, Yair",9,11001,Spanish 1,1,24,D+,E,8,NaN,NaN,NaN,1
629,1093080,"Carranza Villa, Kathlynn",10,11021,Spanish 2,1,24,D,E,1,NaN,NaN,NaN,1
861,1093090,"Gonzalez, Rebecca",11,11021,Spanish 2,1,23,D+,E,1,NaN,NaN,NaN,1
2631,1093165,"Villasenor Chavez, Carlos",12,11001,Spanish 1,2,21,D,E,1,NaN,NaN,NaN,1
3774,1093216,"Zepeda, Khloey",10,11001,Spanish 1,1,24,D+,E,1,NaN,NaN,NaN,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
11482,1094962,"Magana, Yasmin",10,11008,SPAN B1,1,24,D,E,1024,E,10.0,24.0,1
11606,1094970,"Jimenez, Essance",12,11008,SPAN B1,1,22,D,E,1024,E,10.0,24.0,1
12233,1095163,"Barajas, Anthony",10,11008,SPAN B1,1,24,D,E,1024,E,10.0,24.0,1
14201,1095597,"Diaz Carmona, Benito",10,11008,SPAN B1,1,24,D,E,1024,E,10.0,24.0,1
15644,1096028,"Hillman, Zachary",10,11008,SPAN B1,1,24,D,E,1024,E,10.0,24.0,1

In [122]:
# A value of 1 is given to D
spanish_d['Points'] = 1
spanish_d

C:\Users\DEREK~1.CAS\AppData\Local\Temp/ipykernel_19240/1464478387.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  spanish_d['Points'] = 1

,Student ID,Student Name,Grade,Course#,Course,Term,Year,Mark,CSU Req,Sch Taken,UC Req1,Dept,Crs Lvl,Spanish Semesters,Points
67,1092548,"Rodriguez Juarez, Yair",9,11001,Spanish 1,1,24,D+,E,8,NaN,NaN,NaN,1,1
629,1093080,"Carranza Villa, Kathlynn",10,11021,Spanish 2,1,24,D,E,1,NaN,NaN,NaN,1,1
861,1093090,"Gonzalez, Rebecca",11,11021,Spanish 2,1,23,D+,E,1,NaN,NaN,NaN,1,1
2631,1093165,"Villasenor Chavez, Carlos",12,11001,Spanish 1,2,21,D,E,1,NaN,NaN,NaN,1,1
3774,1093216,"Zepeda, Khloey",10,11001,Spanish 1,1,24,D+,E,1,NaN,NaN,NaN,1,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
11482,1094962,"Magana, Yasmin",10,11008,SPAN B1,1,24,D,E,1024,E,10.0,24.0,1,1
11606,1094970,"Jimenez, Essance",12,11008,SPAN B1,1,22,D,E,1024,E,10.0,24.0,1,1
12233,1095163,"Barajas, Anthony",10,11008,SPAN B1,1,24,D,E,1024,E,10.0,24.0,1,1
14201,1095597,"Diaz Carmona, Benito",10,11008,SPAN B1,1,24,D,E,1024,E,10.0,24.0,1,1
15644,1096028,"Hillman, Zachary",10,11008,SPAN B1,1,24,D,E,1024,E,10.0,24.0,1,1

In [123]:
# The F grades are selected
spanish_f = spanish[spanish['Mark'] == 'F']
spanish_f

,Student ID,Student Name,Grade,Course#,Course,Term,Year,Mark,CSU Req,Sch Taken,UC Req1,Dept,Crs Lvl,Spanish Semesters
300,1093039,"Pimentel Gutierrez, Jaymie",9,11001,Spanish 1,1,24,F,E,1,NaN,NaN,NaN,1
6727,1093847,"Medrano, Isauro",9,11001,Spanish 1,1,24,F,E,1,NaN,NaN,NaN,1
15629,1096025,"Luna, Reymond",10,11001,Spanish 1,1,24,F,E,1,NaN,NaN,NaN,1
16322,1096356,"Chavez Hernandez, Ariel",10,11001,Spanish 1,2,23,F,E,1,NaN,NaN,NaN,1
329,1093046,"Gaytan Tapia, Kevin",10,11008,SPAN B1,1,24,F,E,1024,E,10.0,24.0,1
695,1093083,"Aguilera Castro, Angel",11,11008,SPAN B1,1,24,F,E,1024,E,10.0,24.0,1
763,1093086,"Camacho Hernandez, Miguel",11,11008,SPAN B1,1,23,F,E,1024,E,10.0,24.0,1
4093,1093467,"Huy, Donnavin",10,11008,SPAN B1,1,24,F,E,1024,E,10.0,24.0,1
4108,1093468,"Jimenez Carrera, Alexandra",10,11008,SPAN B1,1,24,F,E,1024,E,10.0,24.0,1
4199,1093484,"Gutierrez, Tomas",10,11008,SPAN B1,1,24,F,E,1024,E,10.0,24.0,1
5412,1093592,"Martinez Andrade, Barbara",12,11008,SPAN B1,1,24,F,E,1024,E,10.0,24.0,1
5544,1093607,"Johnston, Ethan",10,11008,SPAN B1,1,24,F,E,1024,E,10.0,24.0,1
6878,1093879,"Martinez Barajas, Ashley",10,11008,SPAN B1,1,24,F,E,1024,E,10.0,24.0,1
7469,1093982,"Vargas, Alexia",11,11008,SPAN B1,0,24,F,E,1024,E,10.0,24.0,1
7893,1094057,"Vazquez, Ashley",10,11008,SPAN B1,1,24,F,E,1024,E,10.0,24.0,1
8262,1094095,"Avila, Dylan",11,11008,SPAN B1,1,24,F,E,1024,E,10.0,24.0,1
10285,1094476,"Ortiz, Karen",11,11008,SPAN B1,1,23,F,E,1024,E,10.0,24.0,1
10693,1094649,"Ruiz Chavez, Chastelin",10,11008,SPAN B1,1,24,F,E,1024,E,10.0,24.0,1
10764,1094671,"Barrientos, Fabian",11,11008,SPAN B1,1,23,F,E,1024,E,10.0,24.0,1
10793,1094672,"Barrientos, Julian",11,11008,SPAN B1,1,23,F,E,1024,E,10.0,24.0,1
10811,1094685,"Ramos, Joel",10,11008,SPAN B1,1,24,F,E,1024,E,10.0,24.0,1
11253,1094872,"Vega, Mario",10,11008,SPAN B1,1,24,F,E,1024,E,10.0,24.0,1
11368,1094913,"Vargas, Leonel",10,11008,SPAN B1,1,24,F,E,1024,E,10.0,24.0,1
12392,1095210,"Hernandez, Lilyann",10,11008,SPAN B1,1,24,F,E,1024,E,10.0,24.0,1
12669,1095225,"Graham, Javion",12,11008,SPAN B1,1,22,F,E,1024,E,10.0,24.0,1
14543,1095838,"Ramirez, Humberto",11,11008,SPAN B1,1,23,F,E,1024,E,10.0,24.0,1
329,1093046,"Gaytan Tapia, Kevin",10,11008,SPAN B1,1,24,F,E,1024,E,10.0,24.0,1
695,1093083,"Aguilera Castro, Angel",11,11008,SPAN B1,1,24,F,E,1024,E,10.0,24.0,1
763,1093086,"Camacho Hernandez, Miguel",11,11008,SPAN B1,1,23,F,E,1024,E,10.0,24.0,1
4093,1093467,"Huy, Donnavin",10,11008,SPAN B1,1,24,F,E,1024,E,10.0,24.0,1
4108,1093468,"Jimenez Carrera, Alexandra",10,11008,SPAN B1,1,24,F,E,1024,E,10.0,24.0,1
4199,1093484,"Gutierrez, Tomas",10,11008,SPAN B1,1,24,F,E,1024,E,10.0,24.0,1
5412,1093592,"Martinez Andrade, Barbara",12,11008,SPAN B1,1,24,F,E,1024,E,10.0,24.0,1
5544,1093607,"Johnston, Ethan",10,11008,SPAN B1,1,24,F,E,1024,E,10.0,24.0,1
6878,1093879,"Martinez Barajas, Ashley",10,11008,SPAN B1,1,24,F,E,1024,E,10.0,24.0,1
7469,1093982,"Vargas, Alexia",11,11008,SPAN B1,0,24,F,E,1024,E,10.0,24.0,1
7893,1094057,"Vazquez, Ashley",10,11008,SPAN B1,1,24,F,E,1024,E,10.0,24.0,1
8262,1094095,"Avila, Dylan",11,11008,SPAN B1,1,24,F,E,1024,E,10.0,24.0,1
10285,1094476,"Ortiz, Karen",11,11008,SPAN B1,1,23,F,E,1024,E,10.0,24.0,1
10693,1094649,"Ruiz Chavez, Chastelin",10,11008,SPAN B1,1,24,F,E,1024,E,10.0,24.0,1
10764,1094671,"Barrientos, Fabian",11,11008,SPAN B1,1,23,F,E,1024,E,10.0,24.0,1
10793,1094672,"Barrientos, Julian",11,11008,SPAN B1,1,23,F,E,1024,E,10.0,24.0,1
10811,1094685,"Ramos, Joel",10,11008,SPAN B1,1,24,F,E,1024,E,10.0,24.0,1
11253,1094872,"Vega, Mario",10,11008,SPAN B1,1,24,F,E,1024,E,10.0,24.0,1
11368,1094913,"Vargas, Leonel",10,11008,SPAN B1,1,24,F,E,1024,E,10.0,24.0,1
12392,1095210,"Hernandez, Lilyann",10,11008,SPAN B1,1,24,F,E,1024,E,10.0,24.0,1
12669,1095225,"Graham, Javion",12,11008,SPAN B1,1,22,F,E,1024,E,10.0,24.0,1
14543,1095838,"Ramirez, Humberto",11,11008,SPAN B1,1,23,F,E,1024,E,10.0,24.0,1

In [124]:
# A value of 0 is given to F
spanish_f['Points'] = 0
spanish_f

C:\Users\DEREK~1.CAS\AppData\Local\Temp/ipykernel_19240/3043563436.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  spanish_f['Points'] = 0

,Student ID,Student Name,Grade,Course#,Course,Term,Year,Mark,CSU Req,Sch Taken,UC Req1,Dept,Crs Lvl,Spanish Semesters,Points
300,1093039,"Pimentel Gutierrez, Jaymie",9,11001,Spanish 1,1,24,F,E,1,NaN,NaN,NaN,1,0
6727,1093847,"Medrano, Isauro",9,11001,Spanish 1,1,24,F,E,1,NaN,NaN,NaN,1,0
15629,1096025,"Luna, Reymond",10,11001,Spanish 1,1,24,F,E,1,NaN,NaN,NaN,1,0
16322,1096356,"Chavez Hernandez, Ariel",10,11001,Spanish 1,2,23,F,E,1,NaN,NaN,NaN,1,0
329,1093046,"Gaytan Tapia, Kevin",10,11008,SPAN B1,1,24,F,E,1024,E,10.0,24.0,1,0
695,1093083,"Aguilera Castro, Angel",11,11008,SPAN B1,1,24,F,E,1024,E,10.0,24.0,1,0
763,1093086,"Camacho Hernandez, Miguel",11,11008,SPAN B1,1,23,F,E,1024,E,10.0,24.0,1,0
4093,1093467,"Huy, Donnavin",10,11008,SPAN B1,1,24,F,E,1024,E,10.0,24.0,1,0
4108,1093468,"Jimenez Carrera, Alexandra",10,11008,SPAN B1,1,24,F,E,1024,E,10.0,24.0,1,0
4199,1093484,"Gutierrez, Tomas",10,11008,SPAN B1,1,24,F,E,1024,E,10.0,24.0,1,0
5412,1093592,"Martinez Andrade, Barbara",12,11008,SPAN B1,1,24,F,E,1024,E,10.0,24.0,1,0
5544,1093607,"Johnston, Ethan",10,11008,SPAN B1,1,24,F,E,1024,E,10.0,24.0,1,0
6878,1093879,"Martinez Barajas, Ashley",10,11008,SPAN B1,1,24,F,E,1024,E,10.0,24.0,1,0
7469,1093982,"Vargas, Alexia",11,11008,SPAN B1,0,24,F,E,1024,E,10.0,24.0,1,0
7893,1094057,"Vazquez, Ashley",10,11008,SPAN B1,1,24,F,E,1024,E,10.0,24.0,1,0
8262,1094095,"Avila, Dylan",11,11008,SPAN B1,1,24,F,E,1024,E,10.0,24.0,1,0
10285,1094476,"Ortiz, Karen",11,11008,SPAN B1,1,23,F,E,1024,E,10.0,24.0,1,0
10693,1094649,"Ruiz Chavez, Chastelin",10,11008,SPAN B1,1,24,F,E,1024,E,10.0,24.0,1,0
10764,1094671,"Barrientos, Fabian",11,11008,SPAN B1,1,23,F,E,1024,E,10.0,24.0,1,0
10793,1094672,"Barrientos, Julian",11,11008,SPAN B1,1,23,F,E,1024,E,10.0,24.0,1,0
10811,1094685,"Ramos, Joel",10,11008,SPAN B1,1,24,F,E,1024,E,10.0,24.0,1,0
11253,1094872,"Vega, Mario",10,11008,SPAN B1,1,24,F,E,1024,E,10.0,24.0,1,0
11368,1094913,"Vargas, Leonel",10,11008,SPAN B1,1,24,F,E,1024,E,10.0,24.0,1,0
12392,1095210,"Hernandez, Lilyann",10,11008,SPAN B1,1,24,F,E,1024,E,10.0,24.0,1,0
12669,1095225,"Graham, Javion",12,11008,SPAN B1,1,22,F,E,1024,E,10.0,24.0,1,0
14543,1095838,"Ramirez, Humberto",11,11008,SPAN B1,1,23,F,E,1024,E,10.0,24.0,1,0
329,1093046,"Gaytan Tapia, Kevin",10,11008,SPAN B1,1,24,F,E,1024,E,10.0,24.0,1,0
695,1093083,"Aguilera Castro, Angel",11,11008,SPAN B1,1,24,F,E,1024,E,10.0,24.0,1,0
763,1093086,"Camacho Hernandez, Miguel",11,11008,SPAN B1,1,23,F,E,1024,E,10.0,24.0,1,0
4093,1093467,"Huy, Donnavin",10,11008,SPAN B1,1,24,F,E,1024,E,10.0,24.0,1,0
4108,1093468,"Jimenez Carrera, Alexandra",10,11008,SPAN B1,1,24,F,E,1024,E,10.0,24.0,1,0
4199,1093484,"Gutierrez, Tomas",10,11008,SPAN B1,1,24,F,E,1024,E,10.0,24.0,1,0
5412,1093592,"Martinez Andrade, Barbara",12,11008,SPAN B1,1,24,F,E,1024,E,10.0,24.0,1,0
5544,1093607,"Johnston, Ethan",10,11008,SPAN B1,1,24,F,E,1024,E,10.0,24.0,1,0
6878,1093879,"Martinez Barajas, Ashley",10,11008,SPAN B1,1,24,F,E,1024,E,10.0,24.0,1,0
7469,1093982,"Vargas, Alexia",11,11008,SPAN B1,0,24,F,E,1024,E,10.0,24.0,1,0
7893,1094057,"Vazquez, Ashley",10,11008,SPAN B1,1,24,F,E,1024,E,10.0,24.0,1,0
8262,1094095,"Avila, Dylan",11,11008,SPAN B1,1,24,F,E,1024,E,10.0,24.0,1,0
10285,1094476,"Ortiz, Karen",11,11008,SPAN B1,1,23,F,E,1024,E,10.0,24.0,1,0
10693,1094649,"Ruiz Chavez, Chastelin",10,11008,SPAN B1,1,24,F,E,1024,E,10.0,24.0,1,0
10764,1094671,"Barrientos, Fabian",11,11008,SPAN B1,1,23,F,E,1024,E,10.0,24.0,1,0
10793,1094672,"Barrientos, Julian",11,11008,SPAN B1,1,23,F,E,1024,E,10.0,24.0,1,0
10811,1094685,"Ramos, Joel",10,11008,SPAN B1,1,24,F,E,1024,E,10.0,24.0,1,0
11253,1094872,"Vega, Mario",10,11008,SPAN B1,1,24,F,E,1024,E,10.0,24.0,1,0
11368,1094913,"Vargas, Leonel",10,11008,SPAN B1,1,24,F,E,1024,E,10.0,24.0,1,0
12392,1095210,"Hernandez, Lilyann",10,11008,SPAN B1,1,24,F,E,1024,E,10.0,24.0,1,0
12669,1095225,"Graham, Javion",12,11008,SPAN B1,1,22,F,E,1024,E,10.0,24.0,1,0
14543,1095838,"Ramirez, Humberto",11,11008,SPAN B1,1,23,F,E,1024,E,10.0,24.0,1,0

In [125]:
# All the grades are put back together again
spanish = pd.concat([spanish_a, spanish_b, spanish_c, spanish_d, spanish_f])
spanish

,Student ID,Student Name,Grade,Course#,Course,Term,Year,Mark,CSU Req,Sch Taken,UC Req1,Dept,Crs Lvl,Spanish Semesters,Points
35,1092539,"Escalante, Anthony",9,11001,Spanish 1,1,24,A,E,8,NaN,NaN,NaN,1,4
44,1092542,"Naranjo Villasana, Jesus",9,11001,Spanish 1,1,24,A,E,8,NaN,NaN,NaN,1,4
145,1092814,"Martinez Carranza, Estefhanny",9,11001,Spanish 1,1,24,A+,E,8,NaN,NaN,NaN,1,4
163,1092988,"Camacho Hernandez, Ana Valeria",9,11001,Spanish 1,1,24,A+,E,1,NaN,NaN,NaN,1,4
171,1092993,"Castaneda, Valerie",9,11001,Spanish 1,1,24,A,E,1,NaN,NaN,NaN,1,4
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
11253,1094872,"Vega, Mario",10,11008,SPAN B1,1,24,F,E,1024,E,10.0,24.0,1,0
11368,1094913,"Vargas, Leonel",10,11008,SPAN B1,1,24,F,E,1024,E,10.0,24.0,1,0
12392,1095210,"Hernandez, Lilyann",10,11008,SPAN B1,1,24,F,E,1024,E,10.0,24.0,1,0
12669,1095225,"Graham, Javion",12,11008,SPAN B1,1,22,F,E,1024,E,10.0,24.0,1,0
14543,1095838,"Ramirez, Humberto",11,11008,SPAN B1,1,23,F,E,1024,E,10.0,24.0,1,0

In [126]:
# The sum of semesters taken is calculated
spanish_courses = spanish.groupby(['Student ID'])['Spanish Semesters'].sum().reset_index()
spanish_courses

     Student ID  Spanish Semesters
0       1092536                  1
1       1092539                  1
2       1092542                  1
3       1092543                  1
4       1092547                  1
..          ...                ...
664     1096642                  1
665     1096718                  1
666     1096726                  1
667     1096738                  1
668     1096745                  1

[669 rows x 2 columns]

In [127]:
# The sum of points is added up based on the grades
spanish_points = spanish.groupby(['Student ID'])['Points'].sum().reset_index()
spanish_points

     Student ID  Points
0       1092536       3
1       1092539       4
2       1092542       4
3       1092543       3
4       1092547       3
..          ...     ...
664     1096642       4
665     1096718       4
666     1096726       3
667     1096738       3
668     1096745       2

[669 rows x 2 columns]

In [128]:
# Semester and points are put together
spanish = pd.merge(spanish_courses, spanish_points, how='inner', on='Student ID')
spanish

     Student ID  Spanish Semesters  Points
0       1092536                  1       3
1       1092539                  1       4
2       1092542                  1       4
3       1092543                  1       3
4       1092547                  1       3
..          ...                ...     ...
664     1096642                  1       4
665     1096718                  1       4
666     1096726                  1       3
667     1096738                  1       3
668     1096745                  1       2

[669 rows x 3 columns]

In [129]:
# GPA is calculated by dividng the points by semesters completed
spanish['Spanish GPA'] = spanish['Points'] / spanish['Spanish Semesters']
spanish

     Student ID  Spanish Semesters  Points  Spanish GPA
0       1092536                  1       3          3.0
1       1092539                  1       4          4.0
2       1092542                  1       4          4.0
3       1092543                  1       3          3.0
4       1092547                  1       3          3.0
..          ...                ...     ...          ...
664     1096642                  1       4          4.0
665     1096718                  1       4          4.0
666     1096726                  1       3          3.0
667     1096738                  1       3          3.0
668     1096745                  1       2          2.0

[669 rows x 4 columns]

In [130]:
# Just the columns of interest are selected
spanish = spanish[['Student ID', 'Spanish Semesters', 'Spanish GPA']]
spanish

     Student ID  Spanish Semesters  Spanish GPA
0       1092536                  1          3.0
1       1092539                  1          4.0
2       1092542                  1          4.0
3       1092543                  1          3.0
4       1092547                  1          3.0
..          ...                ...          ...
664     1096642                  1          4.0
665     1096718                  1          4.0
666     1096726                  1          3.0
667     1096738                  1          3.0
668     1096745                  1          2.0

[669 rows x 3 columns]

## ELA

The GPA for students in their ELA courses will be caclulated in the same manner as the Spanish GPA. But since it is only the ones required for graduation, it will be the top four courses that a student has completed that will be used in calculating the GPA. This will be done by summing the points earned in each course and then have them in descending order and selecting the top four.

In [131]:
# ELA courses are selected by UC/CSU requirement
ela = transcripts[transcripts['CSU Req'] == 'B']
ela

,Student ID,Student Name,Grade,Course#,Course,Term,Year,Mark,CSU Req,Sch Taken,UC Req1,Dept,Crs Lvl
14,1092534,"Aguilar, Fanny",9,1000,Lang Arts 9,1,24,A,B,8,NaN,NaN,NaN
18,1092535,"Ayala, Melenie",9,1000,Lang Arts 9,1,24,B,B,8,NaN,NaN,NaN
20,1092535,"Ayala, Melenie",9,1307,Shakespeare,1,24,A,B,8,NaN,NaN,NaN
24,1092536,"Cabezas Mendoza, Destiny",9,1000,Lang Arts 9,1,24,C,B,8,NaN,NaN,NaN
30,1092538,"Escalante, Elias",9,1000,Lang Arts 9,1,24,B+,B,8,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
16438,1096727,"Velasco San Juan, Yanaly",10,1000,Lang Arts 9,1,23,C,B,1001,NaN,NaN,NaN
16439,1096727,"Velasco San Juan, Yanaly",10,1000,Lang Arts 9,2,23,C,B,1001,NaN,NaN,NaN
16443,1096736,"Manzo, Jordan",9,1000,Lang Arts 9,1,24,C,B,8,NaN,NaN,NaN
16446,1096738,"Hernandez Garcia, Alex",9,1000,Lang Arts 9,1,24,D,B,8,NaN,NaN,NaN
16450,1096745,"Bartolo, Olivia",9,1000,Lang Arts 9,1,24,C+,B,1,NaN,NaN,NaN

### Fixing BC

The BC courses have to be fixed because they represent a full year of coursework rather than one semester like the other courses do.

In [132]:
# Non-BC courses are selected
non_bc = ela[ela['Crs Lvl'] != 24]
non_bc

,Student ID,Student Name,Grade,Course#,Course,Term,Year,Mark,CSU Req,Sch Taken,UC Req1,Dept,Crs Lvl
14,1092534,"Aguilar, Fanny",9,1000,Lang Arts 9,1,24,A,B,8,NaN,NaN,NaN
18,1092535,"Ayala, Melenie",9,1000,Lang Arts 9,1,24,B,B,8,NaN,NaN,NaN
20,1092535,"Ayala, Melenie",9,1307,Shakespeare,1,24,A,B,8,NaN,NaN,NaN
24,1092536,"Cabezas Mendoza, Destiny",9,1000,Lang Arts 9,1,24,C,B,8,NaN,NaN,NaN
30,1092538,"Escalante, Elias",9,1000,Lang Arts 9,1,24,B+,B,8,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
16438,1096727,"Velasco San Juan, Yanaly",10,1000,Lang Arts 9,1,23,C,B,1001,NaN,NaN,NaN
16439,1096727,"Velasco San Juan, Yanaly",10,1000,Lang Arts 9,2,23,C,B,1001,NaN,NaN,NaN
16443,1096736,"Manzo, Jordan",9,1000,Lang Arts 9,1,24,C,B,8,NaN,NaN,NaN
16446,1096738,"Hernandez Garcia, Alex",9,1000,Lang Arts 9,1,24,D,B,8,NaN,NaN,NaN
16450,1096745,"Bartolo, Olivia",9,1000,Lang Arts 9,1,24,C+,B,1,NaN,NaN,NaN

In [133]:
# BC courses selected
bc = ela[ela['Crs Lvl'] == 24]
bc

,Student ID,Student Name,Grade,Course#,Course,Term,Year,Mark,CSU Req,Sch Taken,UC Req1,Dept,Crs Lvl
1464,1093129,"Mora, Sergio",12,1302,ENGL B1A,1,24,B,B,1024,B,1.0,24.0
1547,1093131,"Arredondo, Beyaretzi",12,1302,ENGL B1A,1,24,C,B,1024,B,1.0,24.0
1637,1093135,"Ayon, Erick",12,1302,ENGL B1A,1,24,C,B,1024,B,1.0,24.0
1807,1093140,"Chavez Valdivia, Romina",12,1302,ENGL B1A,1,24,A,B,1024,B,1.0,24.0
1854,1093141,"Cruz, Juan Elias",12,1302,ENGL B1A,1,24,B,B,1024,B,1.0,24.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
13295,1095241,"Rojas Calderon, Deysy",12,1302,ENGL B1A,1,24,W,B,1024,B,1.0,24.0
13335,1095242,"Anaya Avila, Jessenia",12,1302,ENGL B1A,1,24,A,B,1024,B,1.0,24.0
14167,1095593,"Moreno, Leslie",12,1302,ENGL B1A,1,24,C,B,1024,B,1.0,24.0
15114,1095951,"Guerrero, Delaney",12,1302,ENGL B1A,1,24,B,B,1024,B,1.0,24.0
15401,1095975,"Puga, Brianna",12,1302,ENGL B1A,1,24,F,B,1024,B,1.0,24.0

In [134]:
# BC courses are duplicated
bc = pd.concat([bc, bc])
bc

,Student ID,Student Name,Grade,Course#,Course,Term,Year,Mark,CSU Req,Sch Taken,UC Req1,Dept,Crs Lvl
1464,1093129,"Mora, Sergio",12,1302,ENGL B1A,1,24,B,B,1024,B,1.0,24.0
1547,1093131,"Arredondo, Beyaretzi",12,1302,ENGL B1A,1,24,C,B,1024,B,1.0,24.0
1637,1093135,"Ayon, Erick",12,1302,ENGL B1A,1,24,C,B,1024,B,1.0,24.0
1807,1093140,"Chavez Valdivia, Romina",12,1302,ENGL B1A,1,24,A,B,1024,B,1.0,24.0
1854,1093141,"Cruz, Juan Elias",12,1302,ENGL B1A,1,24,B,B,1024,B,1.0,24.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
13295,1095241,"Rojas Calderon, Deysy",12,1302,ENGL B1A,1,24,W,B,1024,B,1.0,24.0
13335,1095242,"Anaya Avila, Jessenia",12,1302,ENGL B1A,1,24,A,B,1024,B,1.0,24.0
14167,1095593,"Moreno, Leslie",12,1302,ENGL B1A,1,24,C,B,1024,B,1.0,24.0
15114,1095951,"Guerrero, Delaney",12,1302,ENGL B1A,1,24,B,B,1024,B,1.0,24.0
15401,1095975,"Puga, Brianna",12,1302,ENGL B1A,1,24,F,B,1024,B,1.0,24.0

In [135]:
# The courses are all put back together
ela = pd.concat([bc, non_bc])
ela

,Student ID,Student Name,Grade,Course#,Course,Term,Year,Mark,CSU Req,Sch Taken,UC Req1,Dept,Crs Lvl
1464,1093129,"Mora, Sergio",12,1302,ENGL B1A,1,24,B,B,1024,B,1.0,24.0
1547,1093131,"Arredondo, Beyaretzi",12,1302,ENGL B1A,1,24,C,B,1024,B,1.0,24.0
1637,1093135,"Ayon, Erick",12,1302,ENGL B1A,1,24,C,B,1024,B,1.0,24.0
1807,1093140,"Chavez Valdivia, Romina",12,1302,ENGL B1A,1,24,A,B,1024,B,1.0,24.0
1854,1093141,"Cruz, Juan Elias",12,1302,ENGL B1A,1,24,B,B,1024,B,1.0,24.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
16438,1096727,"Velasco San Juan, Yanaly",10,1000,Lang Arts 9,1,23,C,B,1001,NaN,NaN,NaN
16439,1096727,"Velasco San Juan, Yanaly",10,1000,Lang Arts 9,2,23,C,B,1001,NaN,NaN,NaN
16443,1096736,"Manzo, Jordan",9,1000,Lang Arts 9,1,24,C,B,8,NaN,NaN,NaN
16446,1096738,"Hernandez Garcia, Alex",9,1000,Lang Arts 9,1,24,D,B,8,NaN,NaN,NaN
16450,1096745,"Bartolo, Olivia",9,1000,Lang Arts 9,1,24,C+,B,1,NaN,NaN,NaN

### ELA GPA Calculation

The GPA will be calculated in the same manner as the Spanish GPA but it will only be for the top four courses that a student did.

In [136]:
# Students are given credit for one semester for each course
ela['ELA Semesters'] = 1
ela

,Student ID,Student Name,Grade,Course#,Course,Term,Year,Mark,CSU Req,Sch Taken,UC Req1,Dept,Crs Lvl,ELA Semesters
1464,1093129,"Mora, Sergio",12,1302,ENGL B1A,1,24,B,B,1024,B,1.0,24.0,1
1547,1093131,"Arredondo, Beyaretzi",12,1302,ENGL B1A,1,24,C,B,1024,B,1.0,24.0,1
1637,1093135,"Ayon, Erick",12,1302,ENGL B1A,1,24,C,B,1024,B,1.0,24.0,1
1807,1093140,"Chavez Valdivia, Romina",12,1302,ENGL B1A,1,24,A,B,1024,B,1.0,24.0,1
1854,1093141,"Cruz, Juan Elias",12,1302,ENGL B1A,1,24,B,B,1024,B,1.0,24.0,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
16438,1096727,"Velasco San Juan, Yanaly",10,1000,Lang Arts 9,1,23,C,B,1001,NaN,NaN,NaN,1
16439,1096727,"Velasco San Juan, Yanaly",10,1000,Lang Arts 9,2,23,C,B,1001,NaN,NaN,NaN,1
16443,1096736,"Manzo, Jordan",9,1000,Lang Arts 9,1,24,C,B,8,NaN,NaN,NaN,1
16446,1096738,"Hernandez Garcia, Alex",9,1000,Lang Arts 9,1,24,D,B,8,NaN,NaN,NaN,1
16450,1096745,"Bartolo, Olivia",9,1000,Lang Arts 9,1,24,C+,B,1,NaN,NaN,NaN,1

In [137]:
# A grades are selected
ela_a = ela[(ela['Mark'] == 'A+') | (ela['Mark'] == 'A') | (ela['Mark'] == 'A-')]
ela_a

,Student ID,Student Name,Grade,Course#,Course,Term,Year,Mark,CSU Req,Sch Taken,UC Req1,Dept,Crs Lvl,ELA Semesters
1807,1093140,"Chavez Valdivia, Romina",12,1302,ENGL B1A,1,24,A,B,1024,B,1.0,24.0,1
1996,1093148,"Lopez, Desiray",12,1302,ENGL B1A,1,24,A,B,1024,B,1.0,24.0,1
2193,1093155,"Panelo, Aiko",12,1302,ENGL B1A,1,24,A,B,1024,B,1.0,24.0,1
2275,1093157,"Ramirez, Natalia",12,1302,ENGL B1A,1,24,A,B,1024,B,1.0,24.0,1
2362,1093159,"Rodriguez Lopez, Alicia",12,1302,ENGL B1A,1,24,A,B,1024,B,1.0,24.0,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
16364,1096490,"Hernandez, Daniela",9,1000,Lang Arts 9,1,24,A,B,8,NaN,NaN,NaN,1
16401,1096621,"Herrera, Joselin",9,1000,Lang Arts 9,1,24,A,B,1,NaN,NaN,NaN,1
16415,1096642,"Damaso, Valeria",9,1000,Lang Arts 9,1,24,A,B,8,NaN,NaN,NaN,1
16422,1096718,"Soriano, Giro",9,1000,Lang Arts 9,1,24,A,B,1,NaN,NaN,NaN,1
16426,1096726,"Torres, Kaitelynn",9,1000,Lang Arts 9,1,24,A,B,1,NaN,NaN,NaN,1

In [138]:
# 4 points are given for each A
ela_a['Points'] = 4
ela_a

C:\Users\DEREK~1.CAS\AppData\Local\Temp/ipykernel_19240/435488287.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  ela_a['Points'] = 4

,Student ID,Student Name,Grade,Course#,Course,Term,Year,Mark,CSU Req,Sch Taken,UC Req1,Dept,Crs Lvl,ELA Semesters,Points
1807,1093140,"Chavez Valdivia, Romina",12,1302,ENGL B1A,1,24,A,B,1024,B,1.0,24.0,1,4
1996,1093148,"Lopez, Desiray",12,1302,ENGL B1A,1,24,A,B,1024,B,1.0,24.0,1,4
2193,1093155,"Panelo, Aiko",12,1302,ENGL B1A,1,24,A,B,1024,B,1.0,24.0,1,4
2275,1093157,"Ramirez, Natalia",12,1302,ENGL B1A,1,24,A,B,1024,B,1.0,24.0,1,4
2362,1093159,"Rodriguez Lopez, Alicia",12,1302,ENGL B1A,1,24,A,B,1024,B,1.0,24.0,1,4
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
16364,1096490,"Hernandez, Daniela",9,1000,Lang Arts 9,1,24,A,B,8,NaN,NaN,NaN,1,4
16401,1096621,"Herrera, Joselin",9,1000,Lang Arts 9,1,24,A,B,1,NaN,NaN,NaN,1,4
16415,1096642,"Damaso, Valeria",9,1000,Lang Arts 9,1,24,A,B,8,NaN,NaN,NaN,1,4
16422,1096718,"Soriano, Giro",9,1000,Lang Arts 9,1,24,A,B,1,NaN,NaN,NaN,1,4
16426,1096726,"Torres, Kaitelynn",9,1000,Lang Arts 9,1,24,A,B,1,NaN,NaN,NaN,1,4

In [139]:
# B grades are selected
ela_b = ela[(ela['Mark'] == 'B+') | (ela['Mark'] == 'B') | (ela['Mark'] == 'B-')]
ela_b

,Student ID,Student Name,Grade,Course#,Course,Term,Year,Mark,CSU Req,Sch Taken,UC Req1,Dept,Crs Lvl,ELA Semesters
1464,1093129,"Mora, Sergio",12,1302,ENGL B1A,1,24,B,B,1024,B,1.0,24.0,1
1854,1093141,"Cruz, Juan Elias",12,1302,ENGL B1A,1,24,B,B,1024,B,1.0,24.0,1
1900,1093143,"Gonzales, Karlie",12,1302,ENGL B1A,1,24,B,B,1024,B,1.0,24.0,1
1948,1093145,"Hernandez, Maite",12,1302,ENGL B1A,1,24,B,B,1024,B,1.0,24.0,1
2753,1093170,"Castellanos, Xai",12,1302,ENGL B1A,1,24,B,B,1024,B,1.0,24.0,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
16374,1096535,"Medina, Henry Gabriel",9,1000,Lang Arts 9,1,24,B+,B,1,NaN,NaN,NaN,1
16386,1096536,"Leal Pacheco, Miguel",10,1000,Lang Arts 9,2,23,B-,B,1096,NaN,NaN,NaN,1
16393,1096610,"Basurto Perez, Aldo",9,1000,Lang Arts 9,1,24,B,B,1,NaN,NaN,NaN,1
16405,1096623,"Higuera, Natalie",9,1000,Lang Arts 9,1,24,B,B,8,NaN,NaN,NaN,1
16411,1096628,"Nunes Salas, Pedro",9,1000,Lang Arts 9,1,24,B+,B,1,NaN,NaN,NaN,1

In [140]:
# A score of 3 is given to each B grade
ela_b['Points'] = 3
ela_b

C:\Users\DEREK~1.CAS\AppData\Local\Temp/ipykernel_19240/2853288067.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  ela_b['Points'] = 3

,Student ID,Student Name,Grade,Course#,Course,Term,Year,Mark,CSU Req,Sch Taken,UC Req1,Dept,Crs Lvl,ELA Semesters,Points
1464,1093129,"Mora, Sergio",12,1302,ENGL B1A,1,24,B,B,1024,B,1.0,24.0,1,3
1854,1093141,"Cruz, Juan Elias",12,1302,ENGL B1A,1,24,B,B,1024,B,1.0,24.0,1,3
1900,1093143,"Gonzales, Karlie",12,1302,ENGL B1A,1,24,B,B,1024,B,1.0,24.0,1,3
1948,1093145,"Hernandez, Maite",12,1302,ENGL B1A,1,24,B,B,1024,B,1.0,24.0,1,3
2753,1093170,"Castellanos, Xai",12,1302,ENGL B1A,1,24,B,B,1024,B,1.0,24.0,1,3
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
16374,1096535,"Medina, Henry Gabriel",9,1000,Lang Arts 9,1,24,B+,B,1,NaN,NaN,NaN,1,3
16386,1096536,"Leal Pacheco, Miguel",10,1000,Lang Arts 9,2,23,B-,B,1096,NaN,NaN,NaN,1,3
16393,1096610,"Basurto Perez, Aldo",9,1000,Lang Arts 9,1,24,B,B,1,NaN,NaN,NaN,1,3
16405,1096623,"Higuera, Natalie",9,1000,Lang Arts 9,1,24,B,B,8,NaN,NaN,NaN,1,3
16411,1096628,"Nunes Salas, Pedro",9,1000,Lang Arts 9,1,24,B+,B,1,NaN,NaN,NaN,1,3

In [141]:
# The C grades are selected
ela_c = ela[(ela['Mark'] == 'C+') | (ela['Mark'] == 'C') | (ela['Mark'] == 'C-')]
ela_c

,Student ID,Student Name,Grade,Course#,Course,Term,Year,Mark,CSU Req,Sch Taken,UC Req1,Dept,Crs Lvl,ELA Semesters
1547,1093131,"Arredondo, Beyaretzi",12,1302,ENGL B1A,1,24,C,B,1024,B,1.0,24.0,1
1637,1093135,"Ayon, Erick",12,1302,ENGL B1A,1,24,C,B,1024,B,1.0,24.0,1
2152,1093154,"Ontiveros, Carissa",12,1302,ENGL B1A,1,24,C,B,1024,B,1.0,24.0,1
2493,1093162,"Segura Castaneda, Manuel",12,1302,ENGL B1A,1,24,C,B,1024,B,1.0,24.0,1
3242,1093189,"Raya, Julissa",12,1302,ENGL B1A,1,24,C,B,1024,B,1.0,24.0,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
16437,1096727,"Velasco San Juan, Yanaly",10,1100,Lang Arts 10,1,24,C+,B,1,NaN,NaN,NaN,1
16438,1096727,"Velasco San Juan, Yanaly",10,1000,Lang Arts 9,1,23,C,B,1001,NaN,NaN,NaN,1
16439,1096727,"Velasco San Juan, Yanaly",10,1000,Lang Arts 9,2,23,C,B,1001,NaN,NaN,NaN,1
16443,1096736,"Manzo, Jordan",9,1000,Lang Arts 9,1,24,C,B,8,NaN,NaN,NaN,1
16450,1096745,"Bartolo, Olivia",9,1000,Lang Arts 9,1,24,C+,B,1,NaN,NaN,NaN,1

In [142]:
# A score of 2 is given for each C grade
ela_c['Points'] = 2
ela_c

C:\Users\DEREK~1.CAS\AppData\Local\Temp/ipykernel_19240/1801789151.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  ela_c['Points'] = 2

,Student ID,Student Name,Grade,Course#,Course,Term,Year,Mark,CSU Req,Sch Taken,UC Req1,Dept,Crs Lvl,ELA Semesters,Points
1547,1093131,"Arredondo, Beyaretzi",12,1302,ENGL B1A,1,24,C,B,1024,B,1.0,24.0,1,2
1637,1093135,"Ayon, Erick",12,1302,ENGL B1A,1,24,C,B,1024,B,1.0,24.0,1,2
2152,1093154,"Ontiveros, Carissa",12,1302,ENGL B1A,1,24,C,B,1024,B,1.0,24.0,1,2
2493,1093162,"Segura Castaneda, Manuel",12,1302,ENGL B1A,1,24,C,B,1024,B,1.0,24.0,1,2
3242,1093189,"Raya, Julissa",12,1302,ENGL B1A,1,24,C,B,1024,B,1.0,24.0,1,2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
16437,1096727,"Velasco San Juan, Yanaly",10,1100,Lang Arts 10,1,24,C+,B,1,NaN,NaN,NaN,1,2
16438,1096727,"Velasco San Juan, Yanaly",10,1000,Lang Arts 9,1,23,C,B,1001,NaN,NaN,NaN,1,2
16439,1096727,"Velasco San Juan, Yanaly",10,1000,Lang Arts 9,2,23,C,B,1001,NaN,NaN,NaN,1,2
16443,1096736,"Manzo, Jordan",9,1000,Lang Arts 9,1,24,C,B,8,NaN,NaN,NaN,1,2
16450,1096745,"Bartolo, Olivia",9,1000,Lang Arts 9,1,24,C+,B,1,NaN,NaN,NaN,1,2

In [143]:
# The D grades are selected
ela_d = ela[(ela['Mark'] == 'D+') | (ela['Mark'] == 'D') | (ela['Mark'] == 'D-')]
ela_d

,Student ID,Student Name,Grade,Course#,Course,Term,Year,Mark,CSU Req,Sch Taken,UC Req1,Dept,Crs Lvl,ELA Semesters
2576,1093164,"Vasquez, Michael",12,1302,ENGL B1A,1,24,D,B,1024,B,1.0,24.0,1
4959,1093554,"Navarro Diaz, Iris",12,1302,ENGL B1A,1,24,D,B,1024,B,1.0,24.0,1
6087,1093709,"Ramirez, Rut",12,1302,ENGL B1A,1,24,D,B,1024,B,1.0,24.0,1
6697,1093839,"Flores, Evette",12,1302,ENGL B1A,1,24,D,B,1024,B,1.0,24.0,1
12913,1095231,"Salas, Marina",12,1302,ENGL B1A,1,24,D,B,1024,B,1.0,24.0,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
16173,1096338,"Estrada, Belinda",11,1100,Lang Arts 10,1,23,D,B,8,NaN,NaN,NaN,1
16174,1096338,"Estrada, Belinda",11,1100,Lang Arts 10,2,23,D+,B,8,NaN,NaN,NaN,1
16319,1096356,"Chavez Hernandez, Ariel",10,1000,Lang Arts 9,2,23,D,B,1,NaN,NaN,NaN,1
16334,1096358,"Martinez, Ethan",10,1100,Lang Arts 10,1,24,D+,B,1,NaN,NaN,NaN,1
16446,1096738,"Hernandez Garcia, Alex",9,1000,Lang Arts 9,1,24,D,B,8,NaN,NaN,NaN,1

In [144]:
# One point is given for each D
ela_d['Points'] = 1
ela_d

C:\Users\DEREK~1.CAS\AppData\Local\Temp/ipykernel_19240/3206112322.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  ela_d['Points'] = 1

,Student ID,Student Name,Grade,Course#,Course,Term,Year,Mark,CSU Req,Sch Taken,UC Req1,Dept,Crs Lvl,ELA Semesters,Points
2576,1093164,"Vasquez, Michael",12,1302,ENGL B1A,1,24,D,B,1024,B,1.0,24.0,1,1
4959,1093554,"Navarro Diaz, Iris",12,1302,ENGL B1A,1,24,D,B,1024,B,1.0,24.0,1,1
6087,1093709,"Ramirez, Rut",12,1302,ENGL B1A,1,24,D,B,1024,B,1.0,24.0,1,1
6697,1093839,"Flores, Evette",12,1302,ENGL B1A,1,24,D,B,1024,B,1.0,24.0,1,1
12913,1095231,"Salas, Marina",12,1302,ENGL B1A,1,24,D,B,1024,B,1.0,24.0,1,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
16173,1096338,"Estrada, Belinda",11,1100,Lang Arts 10,1,23,D,B,8,NaN,NaN,NaN,1,1
16174,1096338,"Estrada, Belinda",11,1100,Lang Arts 10,2,23,D+,B,8,NaN,NaN,NaN,1,1
16319,1096356,"Chavez Hernandez, Ariel",10,1000,Lang Arts 9,2,23,D,B,1,NaN,NaN,NaN,1,1
16334,1096358,"Martinez, Ethan",10,1100,Lang Arts 10,1,24,D+,B,1,NaN,NaN,NaN,1,1
16446,1096738,"Hernandez Garcia, Alex",9,1000,Lang Arts 9,1,24,D,B,8,NaN,NaN,NaN,1,1

In [145]:
# F grades are selected
ela_f = ela[ela['Mark'] == 'F']
ela_f

,Student ID,Student Name,Grade,Course#,Course,Term,Year,Mark,CSU Req,Sch Taken,UC Req1,Dept,Crs Lvl,ELA Semesters
4223,1093487,"Barboza, Andrik",12,1302,ENGL B1A,1,24,F,B,1024,B,1.0,24.0,1
4499,1093496,"Guevara, Darylene",12,1302,ENGL B1A,1,24,F,B,1024,B,1.0,24.0,1
5096,1093569,"Jimenez Martinez, Roxanna",12,1302,ENGL B1A,1,24,F,B,1024,B,1.0,24.0,1
5176,1093571,"Negrete, Angelique",12,1302,ENGL B1A,1,24,F,B,1024,B,1.0,24.0,1
5615,1093649,"Gutierrez, Vicki",12,1302,ENGL B1A,1,24,F,B,1024,B,1.0,24.0,1
5980,1093675,"Bocanegra, Melody",12,1302,ENGL B1A,1,24,F,B,1024,B,1.0,24.0,1
11741,1095046,"Guerrero Marin, Perlita",12,1302,ENGL B1A,1,24,F,B,1024,B,1.0,24.0,1
15401,1095975,"Puga, Brianna",12,1302,ENGL B1A,1,24,F,B,1024,B,1.0,24.0,1
4223,1093487,"Barboza, Andrik",12,1302,ENGL B1A,1,24,F,B,1024,B,1.0,24.0,1
4499,1093496,"Guevara, Darylene",12,1302,ENGL B1A,1,24,F,B,1024,B,1.0,24.0,1
5096,1093569,"Jimenez Martinez, Roxanna",12,1302,ENGL B1A,1,24,F,B,1024,B,1.0,24.0,1
5176,1093571,"Negrete, Angelique",12,1302,ENGL B1A,1,24,F,B,1024,B,1.0,24.0,1
5615,1093649,"Gutierrez, Vicki",12,1302,ENGL B1A,1,24,F,B,1024,B,1.0,24.0,1
5980,1093675,"Bocanegra, Melody",12,1302,ENGL B1A,1,24,F,B,1024,B,1.0,24.0,1
11741,1095046,"Guerrero Marin, Perlita",12,1302,ENGL B1A,1,24,F,B,1024,B,1.0,24.0,1
15401,1095975,"Puga, Brianna",12,1302,ENGL B1A,1,24,F,B,1024,B,1.0,24.0,1
539,1093069,"Rodriguez, Giovanny",10,1150,World Lit,1,24,F,B,1,NaN,NaN,NaN,1
2638,1093165,"Villasenor Chavez, Carlos",12,1150,World Lit,1,22,F,B,1,NaN,NaN,NaN,1
2639,1093165,"Villasenor Chavez, Carlos",12,1150,World Lit,2,22,F,B,1,NaN,NaN,NaN,1
3445,1093200,"Delarmente, Remegio",12,012,English 9 (H),2,21,F,B,1026,NaN,NaN,NaN,1
3454,1093200,"Delarmente, Remegio",12,1300,Lang Arts 12,1,24,F,B,1,NaN,NaN,NaN,1
6165,1093745,"Flores, Jasmine",10,1150,World Lit,1,24,F,B,1,NaN,NaN,NaN,1
9068,1094136,"Ibanez-Ramirez, Zuli",11,012,English 9 (H),1,22,F,B,1023,NaN,NaN,NaN,1
9354,1094184,"Bolanos Vargas, Jimmy",10,1000,Lang Arts 9,1,23,F,B,8,NaN,NaN,NaN,1
9569,1094303,"Elias, Xochilt",12,1300,Lang Arts 12,1,24,F,B,1,NaN,NaN,NaN,1
10695,1094649,"Ruiz Chavez, Chastelin",10,1150,World Lit,1,24,F,B,1,NaN,NaN,NaN,1
11370,1094913,"Vargas, Leonel",10,1150,World Lit,1,24,F,B,1,NaN,NaN,NaN,1
12076,1095120,"Bolanos, Jaime",10,1150,World Lit,1,24,F,B,1,NaN,NaN,NaN,1
13374,1095244,"Hernandez, Michelle",12,1100,Lang Arts 10,1,22,F,B,8,NaN,NaN,NaN,1
13726,1095537,"Flores Garcia, Yulisa",10,1000,Lang Arts 9,1,23,F,B,1023,NaN,NaN,NaN,1
14136,1095588,"Valdez, Joshua",10,1150,World Lit,1,24,F,B,1,NaN,NaN,NaN,1
14826,1095915,"Reveles, Elias",11,1000,Lang Arts 9,2,22,F,B,1,NaN,NaN,NaN,1
15032,1095949,"Torres, Adam",12,012,English 9 (H),1,21,F,B,1071,NaN,NaN,NaN,1
15033,1095949,"Torres, Adam",12,012,English 9 (H),2,21,F,B,1071,NaN,NaN,NaN,1
15180,1095957,"Leon-Saavedra, Gabriel",12,012,English 9 (H),1,21,F,B,1096,NaN,NaN,NaN,1
15189,1095957,"Leon-Saavedra, Gabriel",12,1300,Lang Arts 12,1,24,F,B,1,NaN,NaN,NaN,1
15195,1095957,"Leon-Saavedra, Gabriel",12,TAG,TR Eng Gen,1,21,F,B,1096,NaN,NaN,NaN,1
15354,1095966,"Valdez, Noel",11,1000,Lang Arts 9,1,22,F,B,1,NaN,NaN,NaN,1
15355,1095966,"Valdez, Noel",11,1000,Lang Arts 9,2,22,F,B,1,NaN,NaN,NaN,1
15403,1095975,"Puga, Brianna",12,012,English 9 (H),2,21,F,B,1001,NaN,NaN,NaN,1
15631,1096025,"Luna, Reymond",10,1150,World Lit,1,24,F,B,1,NaN,NaN,NaN,1
16231,1096341,"Yanez, Estiven",10,1000,Lang Arts 9,1,23,F,B,1,NaN,NaN,NaN,1
16234,1096341,"Yanez, Estiven",10,1150,World Lit,1,24,F,B,1,NaN,NaN,NaN,1
16320,1096356,"Chavez Hernandez, Ariel",10,1000,Lang Arts 9,1,23,F,B,1,NaN,NaN,NaN,1
16324,1096356,"Chavez Hernandez, Ariel",10,1150,World Lit,1,24,F,B,1,NaN,NaN,NaN,1
16336,1096358,"Martinez, Ethan",10,1000,Lang Arts 9,1,23,F,B,1,NaN,NaN,NaN,1
16340,1096358,"Martinez, Ethan",10,1150,World Lit,1,24,F,B,1,NaN,NaN,NaN,1

In [146]:
# There is 0 points given for each F
ela_f['Points'] = 0
ela_f

C:\Users\DEREK~1.CAS\AppData\Local\Temp/ipykernel_19240/3586431924.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  ela_f['Points'] = 0

,Student ID,Student Name,Grade,Course#,Course,Term,Year,Mark,CSU Req,Sch Taken,UC Req1,Dept,Crs Lvl,ELA Semesters,Points
4223,1093487,"Barboza, Andrik",12,1302,ENGL B1A,1,24,F,B,1024,B,1.0,24.0,1,0
4499,1093496,"Guevara, Darylene",12,1302,ENGL B1A,1,24,F,B,1024,B,1.0,24.0,1,0
5096,1093569,"Jimenez Martinez, Roxanna",12,1302,ENGL B1A,1,24,F,B,1024,B,1.0,24.0,1,0
5176,1093571,"Negrete, Angelique",12,1302,ENGL B1A,1,24,F,B,1024,B,1.0,24.0,1,0
5615,1093649,"Gutierrez, Vicki",12,1302,ENGL B1A,1,24,F,B,1024,B,1.0,24.0,1,0
5980,1093675,"Bocanegra, Melody",12,1302,ENGL B1A,1,24,F,B,1024,B,1.0,24.0,1,0
11741,1095046,"Guerrero Marin, Perlita",12,1302,ENGL B1A,1,24,F,B,1024,B,1.0,24.0,1,0
15401,1095975,"Puga, Brianna",12,1302,ENGL B1A,1,24,F,B,1024,B,1.0,24.0,1,0
4223,1093487,"Barboza, Andrik",12,1302,ENGL B1A,1,24,F,B,1024,B,1.0,24.0,1,0
4499,1093496,"Guevara, Darylene",12,1302,ENGL B1A,1,24,F,B,1024,B,1.0,24.0,1,0
5096,1093569,"Jimenez Martinez, Roxanna",12,1302,ENGL B1A,1,24,F,B,1024,B,1.0,24.0,1,0
5176,1093571,"Negrete, Angelique",12,1302,ENGL B1A,1,24,F,B,1024,B,1.0,24.0,1,0
5615,1093649,"Gutierrez, Vicki",12,1302,ENGL B1A,1,24,F,B,1024,B,1.0,24.0,1,0
5980,1093675,"Bocanegra, Melody",12,1302,ENGL B1A,1,24,F,B,1024,B,1.0,24.0,1,0
11741,1095046,"Guerrero Marin, Perlita",12,1302,ENGL B1A,1,24,F,B,1024,B,1.0,24.0,1,0
15401,1095975,"Puga, Brianna",12,1302,ENGL B1A,1,24,F,B,1024,B,1.0,24.0,1,0
539,1093069,"Rodriguez, Giovanny",10,1150,World Lit,1,24,F,B,1,NaN,NaN,NaN,1,0
2638,1093165,"Villasenor Chavez, Carlos",12,1150,World Lit,1,22,F,B,1,NaN,NaN,NaN,1,0
2639,1093165,"Villasenor Chavez, Carlos",12,1150,World Lit,2,22,F,B,1,NaN,NaN,NaN,1,0
3445,1093200,"Delarmente, Remegio",12,012,English 9 (H),2,21,F,B,1026,NaN,NaN,NaN,1,0
3454,1093200,"Delarmente, Remegio",12,1300,Lang Arts 12,1,24,F,B,1,NaN,NaN,NaN,1,0
6165,1093745,"Flores, Jasmine",10,1150,World Lit,1,24,F,B,1,NaN,NaN,NaN,1,0
9068,1094136,"Ibanez-Ramirez, Zuli",11,012,English 9 (H),1,22,F,B,1023,NaN,NaN,NaN,1,0
9354,1094184,"Bolanos Vargas, Jimmy",10,1000,Lang Arts 9,1,23,F,B,8,NaN,NaN,NaN,1,0
9569,1094303,"Elias, Xochilt",12,1300,Lang Arts 12,1,24,F,B,1,NaN,NaN,NaN,1,0
10695,1094649,"Ruiz Chavez, Chastelin",10,1150,World Lit,1,24,F,B,1,NaN,NaN,NaN,1,0
11370,1094913,"Vargas, Leonel",10,1150,World Lit,1,24,F,B,1,NaN,NaN,NaN,1,0
12076,1095120,"Bolanos, Jaime",10,1150,World Lit,1,24,F,B,1,NaN,NaN,NaN,1,0
13374,1095244,"Hernandez, Michelle",12,1100,Lang Arts 10,1,22,F,B,8,NaN,NaN,NaN,1,0
13726,1095537,"Flores Garcia, Yulisa",10,1000,Lang Arts 9,1,23,F,B,1023,NaN,NaN,NaN,1,0
14136,1095588,"Valdez, Joshua",10,1150,World Lit,1,24,F,B,1,NaN,NaN,NaN,1,0
14826,1095915,"Reveles, Elias",11,1000,Lang Arts 9,2,22,F,B,1,NaN,NaN,NaN,1,0
15032,1095949,"Torres, Adam",12,012,English 9 (H),1,21,F,B,1071,NaN,NaN,NaN,1,0
15033,1095949,"Torres, Adam",12,012,English 9 (H),2,21,F,B,1071,NaN,NaN,NaN,1,0
15180,1095957,"Leon-Saavedra, Gabriel",12,012,English 9 (H),1,21,F,B,1096,NaN,NaN,NaN,1,0
15189,1095957,"Leon-Saavedra, Gabriel",12,1300,Lang Arts 12,1,24,F,B,1,NaN,NaN,NaN,1,0
15195,1095957,"Leon-Saavedra, Gabriel",12,TAG,TR Eng Gen,1,21,F,B,1096,NaN,NaN,NaN,1,0
15354,1095966,"Valdez, Noel",11,1000,Lang Arts 9,1,22,F,B,1,NaN,NaN,NaN,1,0
15355,1095966,"Valdez, Noel",11,1000,Lang Arts 9,2,22,F,B,1,NaN,NaN,NaN,1,0
15403,1095975,"Puga, Brianna",12,012,English 9 (H),2,21,F,B,1001,NaN,NaN,NaN,1,0
15631,1096025,"Luna, Reymond",10,1150,World Lit,1,24,F,B,1,NaN,NaN,NaN,1,0
16231,1096341,"Yanez, Estiven",10,1000,Lang Arts 9,1,23,F,B,1,NaN,NaN,NaN,1,0
16234,1096341,"Yanez, Estiven",10,1150,World Lit,1,24,F,B,1,NaN,NaN,NaN,1,0
16320,1096356,"Chavez Hernandez, Ariel",10,1000,Lang Arts 9,1,23,F,B,1,NaN,NaN,NaN,1,0
16324,1096356,"Chavez Hernandez, Ariel",10,1150,World Lit,1,24,F,B,1,NaN,NaN,NaN,1,0
16336,1096358,"Martinez, Ethan",10,1000,Lang Arts 9,1,23,F,B,1,NaN,NaN,NaN,1,0
16340,1096358,"Martinez, Ethan",10,1150,World Lit,1,24,F,B,1,NaN,NaN,NaN,1,0

In [147]:
# All the grades are put back together again
ela = pd.concat([ela_a, ela_b, ela_c, ela_d, ela_f])
ela

,Student ID,Student Name,Grade,Course#,Course,Term,Year,Mark,CSU Req,Sch Taken,UC Req1,Dept,Crs Lvl,ELA Semesters,Points
1807,1093140,"Chavez Valdivia, Romina",12,1302,ENGL B1A,1,24,A,B,1024,B,1.0,24.0,1,4
1996,1093148,"Lopez, Desiray",12,1302,ENGL B1A,1,24,A,B,1024,B,1.0,24.0,1,4
2193,1093155,"Panelo, Aiko",12,1302,ENGL B1A,1,24,A,B,1024,B,1.0,24.0,1,4
2275,1093157,"Ramirez, Natalia",12,1302,ENGL B1A,1,24,A,B,1024,B,1.0,24.0,1,4
2362,1093159,"Rodriguez Lopez, Alicia",12,1302,ENGL B1A,1,24,A,B,1024,B,1.0,24.0,1,4
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
16234,1096341,"Yanez, Estiven",10,1150,World Lit,1,24,F,B,1,NaN,NaN,NaN,1,0
16320,1096356,"Chavez Hernandez, Ariel",10,1000,Lang Arts 9,1,23,F,B,1,NaN,NaN,NaN,1,0
16324,1096356,"Chavez Hernandez, Ariel",10,1150,World Lit,1,24,F,B,1,NaN,NaN,NaN,1,0
16336,1096358,"Martinez, Ethan",10,1000,Lang Arts 9,1,23,F,B,1,NaN,NaN,NaN,1,0
16340,1096358,"Martinez, Ethan",10,1150,World Lit,1,24,F,B,1,NaN,NaN,NaN,1,0

In [148]:
# Semesters completed by course are added
ela_courses = ela.groupby(['Student ID', 'Course'])['ELA Semesters'].sum().reset_index()
ela_courses

      Student ID        Course  ELA Semesters
0        1092534   Lang Arts 9              1
1        1092535   Lang Arts 9              1
2        1092535   Shakespeare              1
3        1092536   Lang Arts 9              1
4        1092538   Lang Arts 9              1
...          ...           ...            ...
1861     1096727  Lang Arts 10              1
1862     1096727   Lang Arts 9              2
1863     1096736   Lang Arts 9              1
1864     1096738   Lang Arts 9              1
1865     1096745   Lang Arts 9              1

[1866 rows x 3 columns]

In [149]:
# Points by course are added
ela_points = ela.groupby(['Student ID', 'Course'])['Points'].sum().reset_index()
ela_points

      Student ID        Course  Points
0        1092534   Lang Arts 9       4
1        1092535   Lang Arts 9       3
2        1092535   Shakespeare       4
3        1092536   Lang Arts 9       2
4        1092538   Lang Arts 9       3
...          ...           ...     ...
1861     1096727  Lang Arts 10       2
1862     1096727   Lang Arts 9       4
1863     1096736   Lang Arts 9       2
1864     1096738   Lang Arts 9       1
1865     1096745   Lang Arts 9       2

[1866 rows x 3 columns]

In [150]:
# Semesters and Points are put together
ela = pd.merge(ela_courses, ela_points, how='inner', on=['Student ID', 'Course'])
ela

      Student ID        Course  ELA Semesters  Points
0        1092534   Lang Arts 9              1       4
1        1092535   Lang Arts 9              1       3
2        1092535   Shakespeare              1       4
3        1092536   Lang Arts 9              1       2
4        1092538   Lang Arts 9              1       3
...          ...           ...            ...     ...
1861     1096727  Lang Arts 10              1       2
1862     1096727   Lang Arts 9              2       4
1863     1096736   Lang Arts 9              1       2
1864     1096738   Lang Arts 9              1       1
1865     1096745   Lang Arts 9              1       2

[1866 rows x 4 columns]

In [151]:
# Sorts columns by student id and points in courses
ela = ela.sort_values(by=['Student ID', 'Points'], ascending=[False, False])
ela

      Student ID        Course  ELA Semesters  Points
1865     1096745   Lang Arts 9              1       2
1864     1096738   Lang Arts 9              1       1
1863     1096736   Lang Arts 9              1       2
1862     1096727   Lang Arts 9              2       4
1861     1096727  Lang Arts 10              1       2
...          ...           ...            ...     ...
4        1092538   Lang Arts 9              1       3
3        1092536   Lang Arts 9              1       2
2        1092535   Shakespeare              1       4
1        1092535   Lang Arts 9              1       3
0        1092534   Lang Arts 9              1       4

[1866 rows x 4 columns]

In [152]:
# Picks the top four courses
ela = ela.groupby(['Student ID']).head(4)
ela

      Student ID        Course  ELA Semesters  Points
1865     1096745   Lang Arts 9              1       2
1864     1096738   Lang Arts 9              1       1
1863     1096736   Lang Arts 9              1       2
1862     1096727   Lang Arts 9              2       4
1861     1096727  Lang Arts 10              1       2
...          ...           ...            ...     ...
4        1092538   Lang Arts 9              1       3
3        1092536   Lang Arts 9              1       2
2        1092535   Shakespeare              1       4
1        1092535   Lang Arts 9              1       3
0        1092534   Lang Arts 9              1       4

[1776 rows x 4 columns]

In [153]:
# Sums all of the semesters up
ela_courses = ela.groupby(['Student ID'])['ELA Semesters'].sum().reset_index()
ela_courses

     Student ID  ELA Semesters
0       1092534              1
1       1092535              2
2       1092536              1
3       1092538              1
4       1092539              1
..          ...            ...
711     1096726              1
712     1096727              3
713     1096736              1
714     1096738              1
715     1096745              1

[716 rows x 2 columns]

In [154]:
# Sums up the points earned in ELA
ela_points = ela.groupby(['Student ID'])['Points'].sum().reset_index()
ela_points

     Student ID  Points
0       1092534       4
1       1092535       7
2       1092536       2
3       1092538       3
4       1092539       4
..          ...     ...
711     1096726       4
712     1096727       6
713     1096736       2
714     1096738       1
715     1096745       2

[716 rows x 2 columns]

In [155]:
# Merges semesters and points
ela = pd.merge(ela_courses, ela_points, how='inner', on='Student ID')
ela

     Student ID  ELA Semesters  Points
0       1092534              1       4
1       1092535              2       7
2       1092536              1       2
3       1092538              1       3
4       1092539              1       4
..          ...            ...     ...
711     1096726              1       4
712     1096727              3       6
713     1096736              1       2
714     1096738              1       1
715     1096745              1       2

[716 rows x 3 columns]

In [156]:
# Calculates a GPA by dividing points by semesters
ela['ELA GPA'] = ela['Points'] / ela['ELA Semesters']
ela

     Student ID  ELA Semesters  Points  ELA GPA
0       1092534              1       4      4.0
1       1092535              2       7      3.5
2       1092536              1       2      2.0
3       1092538              1       3      3.0
4       1092539              1       4      4.0
..          ...            ...     ...      ...
711     1096726              1       4      4.0
712     1096727              3       6      2.0
713     1096736              1       2      2.0
714     1096738              1       1      1.0
715     1096745              1       2      2.0

[716 rows x 4 columns]

In [157]:
# Narrows columns down to semesters and ELA GPA
ela = ela[['Student ID', 'ELA Semesters', 'ELA GPA']]
ela

     Student ID  ELA Semesters  ELA GPA
0       1092534              1      4.0
1       1092535              2      3.5
2       1092536              1      2.0
3       1092538              1      3.0
4       1092539              1      4.0
..          ...            ...      ...
711     1096726              1      4.0
712     1096727              3      2.0
713     1096736              1      2.0
714     1096738              1      1.0
715     1096745              1      2.0

[716 rows x 3 columns]

## SBAC

How students performed on the SBAC will be looked at. It will be done by incoporating the cers file that is received and then narrowing it down to summative ELA. If a student scores a 3 or above they will earn a Met for this part if they do not get this score it will be noted that it is Not Met.

In [158]:
tests

,DistrictId,DistrictName,NcesId,SchoolId,SchoolName,StudentIdentifier,FirstName,LastOrSurname,SubmitDateTime,SchoolYear,...,EnglishLanguageAcquisitionStatusStartDate,HispanicOrLatinoEthnicity,AmericanIndianOrAlaskaNative,Asian,BlackOrAfricanAmerican,White,NativeHawaiianOrOtherPacificIslander,TwoOrMoreRaces,Filipino,AssignedAccommodationList
0,1.196690e+12,Wonderful College Prep Academy,1.245000e+04,1.510160e+13,Wonderful College Prep Academy,5662763054,Jessamyn,Rodriguez,47:31.0,2024,...,NaN,Yes,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,1.196690e+12,Wonderful College Prep Academy,1.245000e+04,1.510160e+13,Wonderful College Prep Academy,2716094913,Jenaro,Lopez,52:25.9,2024,...,NaN,Yes,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,1.196690e+12,Wonderful College Prep Academy,1.245000e+04,1.510160e+13,Wonderful College Prep Academy,7091971288,Shiloh,Medina,12:26.1,2024,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Yes,NaN
3,1.196690e+12,Wonderful College Prep Academy,1.245000e+04,1.510160e+13,Wonderful College Prep Academy,2970858622,Edgar,Navarro Solis,09:38.0,2024,...,NaN,Yes,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,1.196690e+12,Wonderful College Prep Academy,1.245000e+04,1.510160e+13,Wonderful College Prep Academy,5278732244,Mason,Fernandez,15:02.4,2024,...,NaN,Yes,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3905,1.354670e+12,Wonderful College Prep Academy - Lost Hills,1.510160e+13,1.510160e+13,Wonderful College Prep Academy - Lost Hills,1518952792,Ashley,Amaya Palacios,11:50.1,2024,...,NaN,Yes,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3906,1.354670e+12,Wonderful College Prep Academy - Lost Hills,1.510160e+13,1.510160e+13,Wonderful College Prep Academy - Lost Hills,2182574790,Julianna,Flores,16:51.1,2024,...,NaN,Yes,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3907,1.354670e+12,Wonderful College Prep Academy - Lost Hills,1.510160e+13,1.510160e+13,Wonderful College Prep Academy - Lost Hills,5705746229,Yariana,Fernandez,50:18.0,2024,...,NaN,Yes,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3908,1.354670e+12,Wonderful College Prep Academy - Lost Hills,1.510160e+13,1.510160e+13,Wonderful College Prep Academy - Lost Hills,2112377512,Jocelyn,Alfaro,53:48.1,2024,...,NaN,Yes,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3909,1.354670e+12,Wonderful College Prep Academy - Lost Hills,1.510160e+13,1.510160e+13,Wonderful College Prep Academy - Lost Hills,5167616152,Angel,Cruz,05:05.7,2024,...,NaN,Yes,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [159]:
# Chooses summative tests
tests = tests[tests['AssessmentType'] == 'Summative']
tests

,DistrictId,DistrictName,NcesId,SchoolId,SchoolName,StudentIdentifier,FirstName,LastOrSurname,SubmitDateTime,SchoolYear,...,EnglishLanguageAcquisitionStatusStartDate,HispanicOrLatinoEthnicity,AmericanIndianOrAlaskaNative,Asian,BlackOrAfricanAmerican,White,NativeHawaiianOrOtherPacificIslander,TwoOrMoreRaces,Filipino,AssignedAccommodationList
0,1.196690e+12,Wonderful College Prep Academy,1.245000e+04,1.510160e+13,Wonderful College Prep Academy,5662763054,Jessamyn,Rodriguez,47:31.0,2024,...,NaN,Yes,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,1.196690e+12,Wonderful College Prep Academy,1.245000e+04,1.510160e+13,Wonderful College Prep Academy,2716094913,Jenaro,Lopez,52:25.9,2024,...,NaN,Yes,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,1.196690e+12,Wonderful College Prep Academy,1.245000e+04,1.510160e+13,Wonderful College Prep Academy,7091971288,Shiloh,Medina,12:26.1,2024,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Yes,NaN
3,1.196690e+12,Wonderful College Prep Academy,1.245000e+04,1.510160e+13,Wonderful College Prep Academy,2970858622,Edgar,Navarro Solis,09:38.0,2024,...,NaN,Yes,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,1.196690e+12,Wonderful College Prep Academy,1.245000e+04,1.510160e+13,Wonderful College Prep Academy,5278732244,Mason,Fernandez,15:02.4,2024,...,NaN,Yes,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3905,1.354670e+12,Wonderful College Prep Academy - Lost Hills,1.510160e+13,1.510160e+13,Wonderful College Prep Academy - Lost Hills,1518952792,Ashley,Amaya Palacios,11:50.1,2024,...,NaN,Yes,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3906,1.354670e+12,Wonderful College Prep Academy - Lost Hills,1.510160e+13,1.510160e+13,Wonderful College Prep Academy - Lost Hills,2182574790,Julianna,Flores,16:51.1,2024,...,NaN,Yes,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3907,1.354670e+12,Wonderful College Prep Academy - Lost Hills,1.510160e+13,1.510160e+13,Wonderful College Prep Academy - Lost Hills,5705746229,Yariana,Fernandez,50:18.0,2024,...,NaN,Yes,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3908,1.354670e+12,Wonderful College Prep Academy - Lost Hills,1.510160e+13,1.510160e+13,Wonderful College Prep Academy - Lost Hills,2112377512,Jocelyn,Alfaro,53:48.1,2024,...,NaN,Yes,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3909,1.354670e+12,Wonderful College Prep Academy - Lost Hills,1.510160e+13,1.510160e+13,Wonderful College Prep Academy - Lost Hills,5167616152,Angel,Cruz,05:05.7,2024,...,NaN,Yes,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [160]:
# Chooses ELA tests
tests = tests[tests['Subject'] == 'ELA']
tests

,DistrictId,DistrictName,NcesId,SchoolId,SchoolName,StudentIdentifier,FirstName,LastOrSurname,SubmitDateTime,SchoolYear,...,EnglishLanguageAcquisitionStatusStartDate,HispanicOrLatinoEthnicity,AmericanIndianOrAlaskaNative,Asian,BlackOrAfricanAmerican,White,NativeHawaiianOrOtherPacificIslander,TwoOrMoreRaces,Filipino,AssignedAccommodationList
432,1.196690e+12,Wonderful College Prep Academy,1.245000e+04,1.510160e+13,Wonderful College Prep Academy,6943872475,Misael,Miranda,31:46.3,2024,...,NaN,Yes,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
433,1.196690e+12,Wonderful College Prep Academy,1.245000e+04,1.510160e+13,Wonderful College Prep Academy,1792542622,Austen,Boles,41:29.0,2024,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Yes,NaN
434,1.196690e+12,Wonderful College Prep Academy,1.245000e+04,1.510160e+13,Wonderful College Prep Academy,9598723402,Blanca,Santana,52:16.1,2024,...,NaN,Yes,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
435,1.196690e+12,Wonderful College Prep Academy,1.245000e+04,1.510160e+13,Wonderful College Prep Academy,1969437598,Katelyn,Cazares,27:37.5,2024,...,NaN,Yes,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
436,1.196690e+12,Wonderful College Prep Academy,1.245000e+04,1.510160e+13,Wonderful College Prep Academy,7685746018,Christopher,Alaniz,37:33.7,2024,...,NaN,Yes,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3347,1.354670e+12,Wonderful College Prep Academy - Lost Hills,1.510160e+13,1.510160e+13,Wonderful College Prep Academy - Lost Hills,2476013692,Alexander,Quinonez Cabezas,54:42.0,2024,...,NaN,Yes,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3348,1.354670e+12,Wonderful College Prep Academy - Lost Hills,1.510160e+13,1.510160e+13,Wonderful College Prep Academy - Lost Hills,4106824233,Jimena,Martinez Quinones,47:27.0,2024,...,NaN,Yes,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3349,1.354670e+12,Wonderful College Prep Academy - Lost Hills,1.510160e+13,1.510160e+13,Wonderful College Prep Academy - Lost Hills,4907204414,Estefhanny,Martinez Carranza,57:20.7,2024,...,NaN,Yes,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3350,1.354670e+12,Wonderful College Prep Academy - Lost Hills,1.510160e+13,1.510160e+13,Wonderful College Prep Academy - Lost Hills,5167616152,Angel,Cruz,44:28.3,2024,...,NaN,Yes,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3351,1.354670e+12,Wonderful College Prep Academy - Lost Hills,1.510160e+13,1.510160e+13,Wonderful College Prep Academy - Lost Hills,5224289736,Yoselin,Perez Hernandez,55:11.1,2024,...,NaN,Yes,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [161]:
# Narrows it down to subject and level
tests = tests[['StudentIdentifier', 'Subject', 'ScaleScoreAchievementLevel']]
tests

      StudentIdentifier Subject  ScaleScoreAchievementLevel
432          6943872475     ELA                           2
433          1792542622     ELA                           2
434          9598723402     ELA                           1
435          1969437598     ELA                           3
436          7685746018     ELA                           3
...                 ...     ...                         ...
3347         2476013692     ELA                           1
3348         4106824233     ELA                           2
3349         4907204414     ELA                           4
3350         5167616152     ELA                           3
3351         5224289736     ELA                           3

[1290 rows x 3 columns]

In [162]:
# Selects levels 3 and above
sbacpass = tests[tests['ScaleScoreAchievementLevel'] >= 3]
sbacpass

      StudentIdentifier Subject  ScaleScoreAchievementLevel
435          1969437598     ELA                           3
436          7685746018     ELA                           3
438          9742794671     ELA                           3
440          1132662565     ELA                           4
441          9117573232     ELA                           3
...                 ...     ...                         ...
3344         1518952792     ELA                           3
3346         7165838913     ELA                           3
3349         4907204414     ELA                           4
3350         5167616152     ELA                           3
3351         5224289736     ELA                           3

[601 rows x 3 columns]

In [163]:
# Gives a value of Met for a new column called SBAC
sbacpass['SBAC'] = 'Met'
sbacpass

C:\Users\DEREK~1.CAS\AppData\Local\Temp/ipykernel_19240/88718776.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  sbacpass['SBAC'] = 'Met'

      StudentIdentifier Subject  ScaleScoreAchievementLevel SBAC
435          1969437598     ELA                           3  Met
436          7685746018     ELA                           3  Met
438          9742794671     ELA                           3  Met
440          1132662565     ELA                           4  Met
441          9117573232     ELA                           3  Met
...                 ...     ...                         ...  ...
3344         1518952792     ELA                           3  Met
3346         7165838913     ELA                           3  Met
3349         4907204414     ELA                           4  Met
3350         5167616152     ELA                           3  Met
3351         5224289736     ELA                           3  Met

[601 rows x 4 columns]

In [164]:
# Selects students with a score of 2 or less
sbacfail = tests[tests['ScaleScoreAchievementLevel'] <= 2]
sbacfail

      StudentIdentifier Subject  ScaleScoreAchievementLevel
432          6943872475     ELA                           2
433          1792542622     ELA                           2
434          9598723402     ELA                           1
437          8781706260     ELA                           2
439          7224686122     ELA                           1
...                 ...     ...                         ...
3334         3974696515     ELA                           1
3343         7264617298     ELA                           1
3345         7529621264     ELA                           1
3347         2476013692     ELA                           1
3348         4106824233     ELA                           2

[689 rows x 3 columns]

In [165]:
# Gives Not Met for SBAC with the students
sbacfail['SBAC'] = 'Not Met'
sbacfail

C:\Users\DEREK~1.CAS\AppData\Local\Temp/ipykernel_19240/434567217.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  sbacfail['SBAC'] = 'Not Met'

      StudentIdentifier Subject  ScaleScoreAchievementLevel     SBAC
432          6943872475     ELA                           2  Not Met
433          1792542622     ELA                           2  Not Met
434          9598723402     ELA                           1  Not Met
437          8781706260     ELA                           2  Not Met
439          7224686122     ELA                           1  Not Met
...                 ...     ...                         ...      ...
3334         3974696515     ELA                           1  Not Met
3343         7264617298     ELA                           1  Not Met
3345         7529621264     ELA                           1  Not Met
3347         2476013692     ELA                           1  Not Met
3348         4106824233     ELA                           2  Not Met

[689 rows x 4 columns]

In [166]:
# Puts all of the SBAC scores back together
sbac = pd.concat([sbacpass, sbacfail])
sbac

      StudentIdentifier Subject  ScaleScoreAchievementLevel     SBAC
435          1969437598     ELA                           3      Met
436          7685746018     ELA                           3      Met
438          9742794671     ELA                           3      Met
440          1132662565     ELA                           4      Met
441          9117573232     ELA                           3      Met
...                 ...     ...                         ...      ...
3334         3974696515     ELA                           1  Not Met
3343         7264617298     ELA                           1  Not Met
3345         7529621264     ELA                           1  Not Met
3347         2476013692     ELA                           1  Not Met
3348         4106824233     ELA                           2  Not Met

[1290 rows x 4 columns]

## Merge

Rosters for students will be narrowed down to those that have taken Spanish 3 and then to those who are in the 12th grade. The data that has been worked on will all be merged with the filtered down roster.

In [167]:
roster

,School,Student ID,State Student ID,Last Name,First Name,Grade,LangFlu
0,1,1095014,9618097825,A Cerda,Eddie,11,R
1,4,1094167,1039097452,Aaron,Anastasia,6,E
2,4,1095258,1300922537,Aaron,Lillie,3,E
3,4,1096128,6616186266,Aburto-Ramirez,Anaiah,1,L
4,4,1093925,8525198790,Aburto-Ramirez,Ayden,4,L
...,...,...,...,...,...,...,...
2374,6,1095271,6705831835,Zuniga,Alan,3,L
2375,7,1092848,8735208851,Zuniga,Michelle,7,R
2376,4,1094487,1654936648,Zuniga,Pedro,5,L
2377,6,1096578,1047271408,Zuniga,Zoe,0,E
2378,6,1094375,2727570780,Zuniga Vazquez,Luis,5,R

In [168]:
transcripts

,Student ID,Student Name,Grade,Course#,Course,Term,Year,Mark,CSU Req,Sch Taken,UC Req1,Dept,Crs Lvl
0,1092408,"Garcia Robles, Daisy",7,LH106,ART 1,2,18,A,F,6,NaN,NaN,NaN
1,1092420,"Barboza, Destinee",7,LH106,ART 1,2,18,A,F,6,NaN,NaN,NaN
2,1092441,"Acosta, Clarissa",7,LH106,ART 1,2,18,A,F,6,NaN,NaN,NaN
3,1092442,"Aguilar, Jesus",7,LH106,ART 1,2,18,A,F,6,NaN,NaN,NaN
4,1092443,"Brown, Nadya",7,LH106,ART 1,2,18,A,F,6,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
16447,1096738,"Hernandez Garcia, Alex",9,11001,Spanish 1,1,24,B,E,8,NaN,NaN,NaN
16448,1096745,"Bartolo, Olivia",9,2010,Alg 1,1,24,B,C,1,NaN,NaN,NaN
16449,1096745,"Bartolo, Olivia",9,5027,Digital Art,1,24,C,F,1,NaN,NaN,NaN
16450,1096745,"Bartolo, Olivia",9,1000,Lang Arts 9,1,24,C+,B,1,NaN,NaN,NaN
16451,1096745,"Bartolo, Olivia",9,11001,Spanish 1,1,24,C,E,1,NaN,NaN,NaN

In [169]:
# Finds Spanish 3 among the transcripts of students
spanish3 = transcripts[transcripts['Course'] == 'Spanish 3']
spanish3

,Student ID,Student Name,Grade,Course#,Course,Term,Year,Mark,CSU Req,Sch Taken,UC Req1,Dept,Crs Lvl
839,1093088,"Diaz Joya, Nareli",11,11003,Spanish 3,1,24,A,E,1,NaN,NaN,NaN
1102,1093100,"Martinez Rojas, Samantha",11,11003,Spanish 3,1,24,B,E,1,NaN,NaN,NaN
1406,1093116,"Garcia Villanueva, Ashley",11,11003,Spanish 3,1,24,A,E,1,NaN,NaN,NaN
1524,1093130,"Padilla, Edgar",12,11003,Spanish 3,1,24,C+,E,1,NaN,NaN,NaN
1661,1093135,"Ayon, Erick",12,11003,Spanish 3,1,24,C,E,1,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
14706,1095886,"Villegas, Isabel",11,11003,Spanish 3,1,24,C+,E,1,NaN,NaN,NaN
14984,1095942,"Rangel Flores, Nancy",12,11003,Spanish 3,1,24,A,E,8,NaN,NaN,NaN
15229,1095958,"Gallegos, Alexander",11,11003,Spanish 3,1,24,C+,E,1,NaN,NaN,NaN
15263,1095959,"Ibarra-Ibarra, Santos",12,11003,Spanish 3,1,24,C,E,1,NaN,NaN,NaN
15334,1095965,"Ontiveros Felix, Missael",12,11003,Spanish 3,1,24,B,E,1,NaN,NaN,NaN

In [170]:
# Selects only 12th graders that took Spanish 3
spanish3 = spanish3[spanish3['Grade'] == 12]
spanish3

,Student ID,Student Name,Grade,Course#,Course,Term,Year,Mark,CSU Req,Sch Taken,UC Req1,Dept,Crs Lvl
1524,1093130,"Padilla, Edgar",12,11003,Spanish 3,1,24,C+,E,1,NaN,NaN,NaN
1661,1093135,"Ayon, Erick",12,11003,Spanish 3,1,24,C,E,1,NaN,NaN,NaN
1697,1093137,"Casillas, Bella",12,11003,Spanish 3,1,24,C,E,1,NaN,NaN,NaN
1832,1093140,"Chavez Valdivia, Romina",12,11003,Spanish 3,1,24,A,E,1,NaN,NaN,NaN
1881,1093141,"Cruz, Juan Elias",12,11003,Spanish 3,1,24,A,E,1,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
13429,1095245,"Palacios, Perla",12,11003,Spanish 3,1,24,A+,E,8,NaN,NaN,NaN
14184,1095593,"Moreno, Leslie",12,11003,Spanish 3,1,24,A,E,8,NaN,NaN,NaN
14984,1095942,"Rangel Flores, Nancy",12,11003,Spanish 3,1,24,A,E,8,NaN,NaN,NaN
15263,1095959,"Ibarra-Ibarra, Santos",12,11003,Spanish 3,1,24,C,E,1,NaN,NaN,NaN
15334,1095965,"Ontiveros Felix, Missael",12,11003,Spanish 3,1,24,B,E,1,NaN,NaN,NaN

In [171]:
# Narrows down just to the Student ID
spanish3 = spanish3[['Student ID']]
spanish3

       Student ID
1524      1093130
1661      1093135
1697      1093137
1832      1093140
1881      1093141
...           ...
13429     1095245
14184     1095593
14984     1095942
15263     1095959
15334     1095965

[76 rows x 1 columns]

In [172]:
# Does an inner join from the transcript to narrow down the roster to just these students
roster = pd.merge(roster, spanish3, how='inner', on='Student ID')
roster

,School,Student ID,State Student ID,Last Name,First Name,Grade,LangFlu
0,1,1095224,3322868264,Acevedo,Italivi,12,R
1,1,1095221,9742794671,Alvarado,Demetrio,12,R
2,8,1095242,1275231058,Anaya Avila,Jessenia,12,R
3,1,1093808,3377072970,Ayala,Nicholas,12,E
4,1,1093135,1132662565,Ayon,Erick,12,R
...,...,...,...,...,...,...,...
71,1,1093838,3018705052,Trejo,Emilly,12,R
72,8,1093655,7900207435,Valenzuela,Diamonique,12,R
73,1,1093196,4003857821,Vargas,Samuel,12,E
74,1,1095102,1223497304,Vargas,Yanitzia,12,R
75,8,1093656,6765392957,Zamudio Silva,Sara,12,R

In [173]:
# Merges in the Spanish GPA
merge = pd.merge(roster, spanish, how='inner', on='Student ID')
merge

,School,Student ID,State Student ID,Last Name,First Name,Grade,LangFlu,Spanish Semesters,Spanish GPA
0,1,1095224,3322868264,Acevedo,Italivi,12,R,7,3.857143
1,1,1095221,9742794671,Alvarado,Demetrio,12,R,7,3.714286
2,8,1095242,1275231058,Anaya Avila,Jessenia,12,R,5,3.800000
3,1,1093808,3377072970,Ayala,Nicholas,12,E,7,2.428571
4,1,1093135,1132662565,Ayon,Erick,12,R,7,2.857143
...,...,...,...,...,...,...,...,...,...
71,1,1093838,3018705052,Trejo,Emilly,12,R,5,3.000000
72,8,1093655,7900207435,Valenzuela,Diamonique,12,R,5,3.600000
73,1,1093196,4003857821,Vargas,Samuel,12,E,7,3.000000
74,1,1095102,1223497304,Vargas,Yanitzia,12,R,7,3.428571
75,8,1093656,6765392957,Zamudio Silva,Sara,12,R,6,3.666667

In [174]:
# Merges in ELA GPA
merge = pd.merge(merge, ela, how='inner', on='Student ID')
merge

,School,Student ID,State Student ID,Last Name,First Name,Grade,LangFlu,Spanish Semesters,Spanish GPA,ELA Semesters,ELA GPA
0,1,1095224,3322868264,Acevedo,Italivi,12,R,7,3.857143,8,4.000000
1,1,1095221,9742794671,Alvarado,Demetrio,12,R,7,3.714286,8,3.500000
2,8,1095242,1275231058,Anaya Avila,Jessenia,12,R,5,3.800000,8,4.000000
3,1,1093808,3377072970,Ayala,Nicholas,12,E,7,2.428571,8,3.250000
4,1,1093135,1132662565,Ayon,Erick,12,R,7,2.857143,8,3.250000
...,...,...,...,...,...,...,...,...,...,...,...
71,1,1093838,3018705052,Trejo,Emilly,12,R,5,3.000000,7,3.285714
72,8,1093655,7900207435,Valenzuela,Diamonique,12,R,5,3.600000,8,3.375000
73,1,1093196,4003857821,Vargas,Samuel,12,E,7,3.000000,8,3.375000
74,1,1095102,1223497304,Vargas,Yanitzia,12,R,7,3.428571,8,4.000000
75,8,1093656,6765392957,Zamudio Silva,Sara,12,R,6,3.666667,8,3.500000

In [175]:
# Merges in how students performed on the SBAC
merge = pd.merge(merge, sbac, how='left', left_on='State Student ID', right_on='StudentIdentifier')
merge

,School,Student ID,State Student ID,Last Name,First Name,Grade,LangFlu,Spanish Semesters,Spanish GPA,ELA Semesters,ELA GPA,StudentIdentifier,Subject,ScaleScoreAchievementLevel,SBAC
0,1,1095224,3322868264,Acevedo,Italivi,12,R,7,3.857143,8,4.000000,3322868264,ELA,4,Met
1,1,1095221,9742794671,Alvarado,Demetrio,12,R,7,3.714286,8,3.500000,9742794671,ELA,3,Met
2,8,1095242,1275231058,Anaya Avila,Jessenia,12,R,5,3.800000,8,4.000000,1275231058,ELA,4,Met
3,1,1093808,3377072970,Ayala,Nicholas,12,E,7,2.428571,8,3.250000,3377072970,ELA,3,Met
4,1,1093135,1132662565,Ayon,Erick,12,R,7,2.857143,8,3.250000,1132662565,ELA,4,Met
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
71,1,1093838,3018705052,Trejo,Emilly,12,R,5,3.000000,7,3.285714,3018705052,ELA,3,Met
72,8,1093655,7900207435,Valenzuela,Diamonique,12,R,5,3.600000,8,3.375000,7900207435,ELA,3,Met
73,1,1093196,4003857821,Vargas,Samuel,12,E,7,3.000000,8,3.375000,4003857821,ELA,4,Met
74,1,1095102,1223497304,Vargas,Yanitzia,12,R,7,3.428571,8,4.000000,1223497304,ELA,3,Met
75,8,1093656,6765392957,Zamudio Silva,Sara,12,R,6,3.666667,8,3.500000,6765392957,ELA,3,Met

In [176]:
# Drops any extra categories
merge = merge.drop(columns=['StudentIdentifier', 'Subject', 'ScaleScoreAchievementLevel'])
merge

,School,Student ID,State Student ID,Last Name,First Name,Grade,LangFlu,Spanish Semesters,Spanish GPA,ELA Semesters,ELA GPA,SBAC
0,1,1095224,3322868264,Acevedo,Italivi,12,R,7,3.857143,8,4.000000,Met
1,1,1095221,9742794671,Alvarado,Demetrio,12,R,7,3.714286,8,3.500000,Met
2,8,1095242,1275231058,Anaya Avila,Jessenia,12,R,5,3.800000,8,4.000000,Met
3,1,1093808,3377072970,Ayala,Nicholas,12,E,7,2.428571,8,3.250000,Met
4,1,1093135,1132662565,Ayon,Erick,12,R,7,2.857143,8,3.250000,Met
...,...,...,...,...,...,...,...,...,...,...,...,...
71,1,1093838,3018705052,Trejo,Emilly,12,R,5,3.000000,7,3.285714,Met
72,8,1093655,7900207435,Valenzuela,Diamonique,12,R,5,3.600000,8,3.375000,Met
73,1,1093196,4003857821,Vargas,Samuel,12,E,7,3.000000,8,3.375000,Met
74,1,1095102,1223497304,Vargas,Yanitzia,12,R,7,3.428571,8,4.000000,Met
75,8,1093656,6765392957,Zamudio Silva,Sara,12,R,6,3.666667,8,3.500000,Met

## On Track

In [183]:
merge

,School,Student ID,State Student ID,Last Name,First Name,Grade,LangFlu,Spanish Semesters,Spanish GPA,ELA Semesters,ELA GPA,SBAC
0,1,1095224,3322868264,Acevedo,Italivi,12,R,7,3.857143,8,4.000000,Met
1,1,1095221,9742794671,Alvarado,Demetrio,12,R,7,3.714286,8,3.500000,Met
2,8,1095242,1275231058,Anaya Avila,Jessenia,12,R,5,3.800000,8,4.000000,Met
3,1,1093808,3377072970,Ayala,Nicholas,12,E,7,2.428571,8,3.250000,Met
4,1,1093135,1132662565,Ayon,Erick,12,R,7,2.857143,8,3.250000,Met
...,...,...,...,...,...,...,...,...,...,...,...,...
71,1,1093838,3018705052,Trejo,Emilly,12,R,5,3.000000,7,3.285714,Met
72,8,1093655,7900207435,Valenzuela,Diamonique,12,R,5,3.600000,8,3.375000,Met
73,1,1093196,4003857821,Vargas,Samuel,12,E,7,3.000000,8,3.375000,Met
74,1,1095102,1223497304,Vargas,Yanitzia,12,R,7,3.428571,8,4.000000,Met
75,8,1093656,6765392957,Zamudio Silva,Sara,12,R,6,3.666667,8,3.500000,Met

In [184]:
# Students who have under a 3.0 in Spanish classes
spanish_no = merge[merge['Spanish GPA'] < 3]
spanish_no

,School,Student ID,State Student ID,Last Name,First Name,Grade,LangFlu,Spanish Semesters,Spanish GPA,ELA Semesters,ELA GPA,SBAC
3,1,1093808,3377072970,Ayala,Nicholas,12,E,7,2.428571,8,3.250000,Met
4,1,1093135,1132662565,Ayon,Erick,12,R,7,2.857143,8,3.250000,Met
8,1,1093137,8781706260,Casillas,Bella,12,R,7,2.428571,8,3.750000,Not Met
12,1,1093791,6563075310,Chavez Coss,Maria,12,R,5,2.400000,7,2.857143,Not Met
16,1,1093863,8267382167,Cortes Perez,Eduardo,12,R,7,2.714286,7,3.428571,Met
31,1,1095959,6593683746,Ibarra-Ibarra,Santos,12,R,5,2.600000,8,3.500000,Not Met
35,1,1093195,2405619516,Lara Zambrano,Nayeli,12,R,7,2.571429,8,3.500000,Met
36,1,1093203,2234131075,Lopez,Avelina,12,E,7,2.714286,8,2.875000,Met
39,1,1093592,6560537185,Martinez Andrade,Barbara,12,R,7,1.428571,7,2.285714,Not Met
52,1,1093130,2119110963,Padilla,Edgar,12,R,5,2.600000,7,3.142857,Met
55,1,1093156,7344335935,Perez,Jonathan,12,L,5,2.800000,7,3.714286,Not Met
57,1,1095219,7600509988,Ramirez,Clarissa,12,R,7,2.857143,8,3.250000,Met
64,1,1095231,6019779701,Salas,Marina,12,R,7,2.857143,8,3.000000,Met
66,1,1095094,8660014828,Sanchez,Alexis,12,R,5,2.600000,8,3.000000,Not Met
68,1,1093193,9598723402,Santana,Blanca,12,R,5,2.600000,7,3.000000,Not Met
69,1,1094021,2730343691,Silva Guzman,Laura,12,R,5,2.800000,8,3.000000,Not Met

In [185]:
# Students are labeled as not on track since they are not meeting Spanish requirement
spanish_no['On Track'] = 'No'
spanish_no

C:\Users\DEREK~1.CAS\AppData\Local\Temp/ipykernel_19240/871023961.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  spanish_no['On Track'] = 'No'

,School,Student ID,State Student ID,Last Name,First Name,Grade,LangFlu,Spanish Semesters,Spanish GPA,ELA Semesters,ELA GPA,SBAC,On Track
3,1,1093808,3377072970,Ayala,Nicholas,12,E,7,2.428571,8,3.250000,Met,No
4,1,1093135,1132662565,Ayon,Erick,12,R,7,2.857143,8,3.250000,Met,No
8,1,1093137,8781706260,Casillas,Bella,12,R,7,2.428571,8,3.750000,Not Met,No
12,1,1093791,6563075310,Chavez Coss,Maria,12,R,5,2.400000,7,2.857143,Not Met,No
16,1,1093863,8267382167,Cortes Perez,Eduardo,12,R,7,2.714286,7,3.428571,Met,No
31,1,1095959,6593683746,Ibarra-Ibarra,Santos,12,R,5,2.600000,8,3.500000,Not Met,No
35,1,1093195,2405619516,Lara Zambrano,Nayeli,12,R,7,2.571429,8,3.500000,Met,No
36,1,1093203,2234131075,Lopez,Avelina,12,E,7,2.714286,8,2.875000,Met,No
39,1,1093592,6560537185,Martinez Andrade,Barbara,12,R,7,1.428571,7,2.285714,Not Met,No
52,1,1093130,2119110963,Padilla,Edgar,12,R,5,2.600000,7,3.142857,Met,No
55,1,1093156,7344335935,Perez,Jonathan,12,L,5,2.800000,7,3.714286,Not Met,No
57,1,1095219,7600509988,Ramirez,Clarissa,12,R,7,2.857143,8,3.250000,Met,No
64,1,1095231,6019779701,Salas,Marina,12,R,7,2.857143,8,3.000000,Met,No
66,1,1095094,8660014828,Sanchez,Alexis,12,R,5,2.600000,8,3.000000,Not Met,No
68,1,1093193,9598723402,Santana,Blanca,12,R,5,2.600000,7,3.000000,Not Met,No
69,1,1094021,2730343691,Silva Guzman,Laura,12,R,5,2.800000,8,3.000000,Not Met,No

In [186]:
# Selecting students who have a Spanish GPA 3.0
spanish_yes = merge[merge['Spanish GPA'] >= 3]
spanish_yes

,School,Student ID,State Student ID,Last Name,First Name,Grade,LangFlu,Spanish Semesters,Spanish GPA,ELA Semesters,ELA GPA,SBAC
0,1,1095224,3322868264,Acevedo,Italivi,12,R,7,3.857143,8,4.000000,Met
1,1,1095221,9742794671,Alvarado,Demetrio,12,R,7,3.714286,8,3.500000,Met
2,8,1095242,1275231058,Anaya Avila,Jessenia,12,R,5,3.800000,8,4.000000,Met
5,8,1093487,6103250605,Barboza,Andrik,12,R,5,4.000000,8,2.875000,Met
6,8,1093488,5074689903,Bautista Martinez,Juan,12,R,6,3.166667,8,3.375000,Met
7,1,1095229,2212813348,Cabrera,Lizbeth,12,R,7,4.000000,8,4.000000,Met
9,8,1093490,6718225590,Castillo,Martha,12,R,6,4.000000,8,3.500000,Met
10,1,1093214,7670257356,Cervantes,Alejandro,12,R,7,4.000000,8,3.750000,Met
11,1,1095101,4556164230,Chaidez,Anahi,12,R,7,3.285714,8,3.750000,Met
13,8,1093492,7415071020,Chavez Salgado,Denisse,12,R,7,3.714286,8,3.625000,Met
14,1,1093140,5981436494,Chavez Valdivia,Romina,12,E,7,4.000000,8,4.000000,Met
15,1,1094023,8739597115,Correa,Miguel,12,R,7,3.571429,8,3.750000,Not Met
17,8,1094285,1242332425,Covarrubias,Ethan,12,E,5,3.600000,8,3.375000,Met
18,1,1093141,9945214896,Cruz,Juan Elias,12,I,7,3.714286,8,3.750000,Met
19,1,1093177,9979703302,Cruz Ceja,Jesceli,12,R,7,3.428571,8,4.000000,Met
20,1,1093356,8008056775,De Luna,Kristian,12,R,7,4.000000,8,3.750000,Met
21,1,1093174,8384113214,Devera,Ethan,12,E,7,3.142857,8,4.000000,Met
22,1,1095228,1522488295,Espinoza,Leslli,12,R,7,3.285714,8,3.625000,Met
23,1,1094484,4532271208,Fajardo,Maria,12,L,5,3.800000,8,4.000000,Not Met
24,8,1093494,4022762449,Felix Lopez,Anna,12,R,5,4.000000,8,4.000000,Met
25,1,1093201,7424722787,Garcia,Nenet,12,E,7,3.285714,8,4.000000,Met
26,1,1095217,9165287788,Gudino Rosas,Carlin,12,R,7,3.857143,8,4.000000,Met
27,8,1095046,5578393320,Guerrero Marin,Perlita,12,R,6,3.333333,8,2.750000,Met
28,8,1093496,5017425006,Guevara,Darylene,12,R,5,4.000000,8,2.750000,Met
29,1,1094401,9060039663,Hardman,Desmond,12,E,7,4.000000,8,4.000000,Met
30,1,1093544,9709226910,Herrera Heredia,Karen,12,R,7,4.000000,8,4.000000,Met
32,1,1093179,9480522431,Jaime,Skyelynn,12,E,7,3.857143,8,3.750000,Met
33,8,1093569,2130707002,Jimenez Martinez,Roxanna,12,R,6,3.333333,8,2.500000,Met
34,8,1093651,3079416712,Juarez,Melissa,12,R,5,4.000000,8,4.000000,Met
37,8,1093657,8278194669,Lopez Rondan,Aaron,12,R,6,4.000000,8,3.750000,Met
38,1,1095230,6464274513,Madriz LÃ³pez,Maricarmen,12,R,7,3.428571,7,3.285714,Met
40,8,1093570,4467358383,Martinez Diaz,Maria,12,L,5,3.800000,8,3.000000,Met
41,1,1094658,7557588055,Mendoza Carranza,Galilea,12,R,7,3.428571,8,3.750000,Met
42,1,1093183,8566147967,Monroy,Gabriela,12,R,7,3.428571,8,3.625000,Met
43,8,1094395,1319511273,Mora Zuniga,Cristal,12,R,6,3.500000,8,3.250000,Not Met
44,8,1095593,6177610326,Moreno,Leslie,12,R,5,3.600000,8,3.125000,Met
45,8,1093571,6468477568,Negrete,Angelique,12,R,6,3.500000,8,2.375000,Not Met
46,1,1093184,2390419451,Negrete,Jocelyn,12,R,7,3.714286,8,4.000000,Met
47,8,1093652,8367430397,Negrete Garcia,Juan,12,R,5,3.600000,8,3.375000,Met
48,1,1093512,8138838780,Nunez,Celeste,12,R,7,3.285714,8,3.500000,Met
49,1,1093186,2387194176,Ochoa,Diego,12,R,7,3.285714,8,3.625000,Met
50,1,1095965,4942480713,Ontiveros Felix,Missael,12,R,3,3.666667,8,3.625000,Not Met
51,1,1093185,5781604926,Otero,Stephanie,12,R,7,3.571429,8,3.875000,Met
53,8,1095245,2745575537,Palacios,Perla,12,R,7,4.000000,6,3.833333,Met
54,1,1093671,9007097297,Pena,Nayely,12,R,7,3.571429,8,3.750000,Met
56,1,1093215,4619468621,Pimentel,Aubrey,12,E,7,3.285714,8,3.750000,Met
58,1,1093157,5177026517,Ramirez,Natalia,12,I,7,3.428571,8,3.875000,Met
59,8,1095942,9953526892,Rangel Flores,Nancy,12,R,7,3.571429,7,3.285714,Met
60,1,1093159,1650536212,Rodriguez Lopez,Alicia,12,R,7,4.000000,8,4.000000,Met
61,8,1095241,5022961290,Rojas Calderon,Deysy,12,R,6,4.000000,7,3.285714,Not Met
62,1,1093786,6190315356,Romano Angel,Carlos,12,R,7,3.571429,8,3.625000,Met
63,1,1095234,7046740484,Ruiz,Sebastian,12,E,7,3.285714,8,3.500000,Met
65,1,1093691,5161026802,Salas,Patricio,12,R,5,3.200000,7,3.571429,Met
67,1,1093784,4751049881,Sanchez Mejia,Alondra,12,R,7,4.000000,8,4.000000,Met
70,1,1093785,1270376673,Soto,Janelle,12,R,5,3.200000,8,3.625000,Not Met
71,1,1093838,3018705052,Trejo,Emilly,12,R,5,3.000000,7,3.285714,Met
72,8,1093655,7900207435,Valenzuela,Diamonique,12,R,5,3.600000,8,3.375000,Met
73,1,1093196,4003857821,Vargas,Samuel,12,E,7,3.000000,8,3.375000,Met
74,1,1095102,1223497304,Vargas,Yanitzia,12,R,7,3.428571,8,4.000000,Met
75,8,1093656,6765392957,Zamudio Silva,Sara,12,R,6,3.666667,8,3.500000,Met

In [187]:
# Selects students who have met SBAC who are meeting Spanish GPA requirement
spanish_sbac = spanish_yes[spanish_yes['SBAC'] == 'Met']
spanish_sbac

,School,Student ID,State Student ID,Last Name,First Name,Grade,LangFlu,Spanish Semesters,Spanish GPA,ELA Semesters,ELA GPA,SBAC
0,1,1095224,3322868264,Acevedo,Italivi,12,R,7,3.857143,8,4.000000,Met
1,1,1095221,9742794671,Alvarado,Demetrio,12,R,7,3.714286,8,3.500000,Met
2,8,1095242,1275231058,Anaya Avila,Jessenia,12,R,5,3.800000,8,4.000000,Met
5,8,1093487,6103250605,Barboza,Andrik,12,R,5,4.000000,8,2.875000,Met
6,8,1093488,5074689903,Bautista Martinez,Juan,12,R,6,3.166667,8,3.375000,Met
7,1,1095229,2212813348,Cabrera,Lizbeth,12,R,7,4.000000,8,4.000000,Met
9,8,1093490,6718225590,Castillo,Martha,12,R,6,4.000000,8,3.500000,Met
10,1,1093214,7670257356,Cervantes,Alejandro,12,R,7,4.000000,8,3.750000,Met
11,1,1095101,4556164230,Chaidez,Anahi,12,R,7,3.285714,8,3.750000,Met
13,8,1093492,7415071020,Chavez Salgado,Denisse,12,R,7,3.714286,8,3.625000,Met
14,1,1093140,5981436494,Chavez Valdivia,Romina,12,E,7,4.000000,8,4.000000,Met
17,8,1094285,1242332425,Covarrubias,Ethan,12,E,5,3.600000,8,3.375000,Met
18,1,1093141,9945214896,Cruz,Juan Elias,12,I,7,3.714286,8,3.750000,Met
19,1,1093177,9979703302,Cruz Ceja,Jesceli,12,R,7,3.428571,8,4.000000,Met
20,1,1093356,8008056775,De Luna,Kristian,12,R,7,4.000000,8,3.750000,Met
21,1,1093174,8384113214,Devera,Ethan,12,E,7,3.142857,8,4.000000,Met
22,1,1095228,1522488295,Espinoza,Leslli,12,R,7,3.285714,8,3.625000,Met
24,8,1093494,4022762449,Felix Lopez,Anna,12,R,5,4.000000,8,4.000000,Met
25,1,1093201,7424722787,Garcia,Nenet,12,E,7,3.285714,8,4.000000,Met
26,1,1095217,9165287788,Gudino Rosas,Carlin,12,R,7,3.857143,8,4.000000,Met
27,8,1095046,5578393320,Guerrero Marin,Perlita,12,R,6,3.333333,8,2.750000,Met
28,8,1093496,5017425006,Guevara,Darylene,12,R,5,4.000000,8,2.750000,Met
29,1,1094401,9060039663,Hardman,Desmond,12,E,7,4.000000,8,4.000000,Met
30,1,1093544,9709226910,Herrera Heredia,Karen,12,R,7,4.000000,8,4.000000,Met
32,1,1093179,9480522431,Jaime,Skyelynn,12,E,7,3.857143,8,3.750000,Met
33,8,1093569,2130707002,Jimenez Martinez,Roxanna,12,R,6,3.333333,8,2.500000,Met
34,8,1093651,3079416712,Juarez,Melissa,12,R,5,4.000000,8,4.000000,Met
37,8,1093657,8278194669,Lopez Rondan,Aaron,12,R,6,4.000000,8,3.750000,Met
38,1,1095230,6464274513,Madriz LÃ³pez,Maricarmen,12,R,7,3.428571,7,3.285714,Met
40,8,1093570,4467358383,Martinez Diaz,Maria,12,L,5,3.800000,8,3.000000,Met
41,1,1094658,7557588055,Mendoza Carranza,Galilea,12,R,7,3.428571,8,3.750000,Met
42,1,1093183,8566147967,Monroy,Gabriela,12,R,7,3.428571,8,3.625000,Met
44,8,1095593,6177610326,Moreno,Leslie,12,R,5,3.600000,8,3.125000,Met
46,1,1093184,2390419451,Negrete,Jocelyn,12,R,7,3.714286,8,4.000000,Met
47,8,1093652,8367430397,Negrete Garcia,Juan,12,R,5,3.600000,8,3.375000,Met
48,1,1093512,8138838780,Nunez,Celeste,12,R,7,3.285714,8,3.500000,Met
49,1,1093186,2387194176,Ochoa,Diego,12,R,7,3.285714,8,3.625000,Met
51,1,1093185,5781604926,Otero,Stephanie,12,R,7,3.571429,8,3.875000,Met
53,8,1095245,2745575537,Palacios,Perla,12,R,7,4.000000,6,3.833333,Met
54,1,1093671,9007097297,Pena,Nayely,12,R,7,3.571429,8,3.750000,Met
56,1,1093215,4619468621,Pimentel,Aubrey,12,E,7,3.285714,8,3.750000,Met
58,1,1093157,5177026517,Ramirez,Natalia,12,I,7,3.428571,8,3.875000,Met
59,8,1095942,9953526892,Rangel Flores,Nancy,12,R,7,3.571429,7,3.285714,Met
60,1,1093159,1650536212,Rodriguez Lopez,Alicia,12,R,7,4.000000,8,4.000000,Met
62,1,1093786,6190315356,Romano Angel,Carlos,12,R,7,3.571429,8,3.625000,Met
63,1,1095234,7046740484,Ruiz,Sebastian,12,E,7,3.285714,8,3.500000,Met
65,1,1093691,5161026802,Salas,Patricio,12,R,5,3.200000,7,3.571429,Met
67,1,1093784,4751049881,Sanchez Mejia,Alondra,12,R,7,4.000000,8,4.000000,Met
71,1,1093838,3018705052,Trejo,Emilly,12,R,5,3.000000,7,3.285714,Met
72,8,1093655,7900207435,Valenzuela,Diamonique,12,R,5,3.600000,8,3.375000,Met
73,1,1093196,4003857821,Vargas,Samuel,12,E,7,3.000000,8,3.375000,Met
74,1,1095102,1223497304,Vargas,Yanitzia,12,R,7,3.428571,8,4.000000,Met
75,8,1093656,6765392957,Zamudio Silva,Sara,12,R,6,3.666667,8,3.500000,Met

In [188]:
# Saying these students are on track
spanish_sbac['On Track'] = 'Yes'
spanish_sbac

C:\Users\DEREK~1.CAS\AppData\Local\Temp/ipykernel_19240/2079686279.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  spanish_sbac['On Track'] = 'Yes'

,School,Student ID,State Student ID,Last Name,First Name,Grade,LangFlu,Spanish Semesters,Spanish GPA,ELA Semesters,ELA GPA,SBAC,On Track
0,1,1095224,3322868264,Acevedo,Italivi,12,R,7,3.857143,8,4.000000,Met,Yes
1,1,1095221,9742794671,Alvarado,Demetrio,12,R,7,3.714286,8,3.500000,Met,Yes
2,8,1095242,1275231058,Anaya Avila,Jessenia,12,R,5,3.800000,8,4.000000,Met,Yes
5,8,1093487,6103250605,Barboza,Andrik,12,R,5,4.000000,8,2.875000,Met,Yes
6,8,1093488,5074689903,Bautista Martinez,Juan,12,R,6,3.166667,8,3.375000,Met,Yes
7,1,1095229,2212813348,Cabrera,Lizbeth,12,R,7,4.000000,8,4.000000,Met,Yes
9,8,1093490,6718225590,Castillo,Martha,12,R,6,4.000000,8,3.500000,Met,Yes
10,1,1093214,7670257356,Cervantes,Alejandro,12,R,7,4.000000,8,3.750000,Met,Yes
11,1,1095101,4556164230,Chaidez,Anahi,12,R,7,3.285714,8,3.750000,Met,Yes
13,8,1093492,7415071020,Chavez Salgado,Denisse,12,R,7,3.714286,8,3.625000,Met,Yes
14,1,1093140,5981436494,Chavez Valdivia,Romina,12,E,7,4.000000,8,4.000000,Met,Yes
17,8,1094285,1242332425,Covarrubias,Ethan,12,E,5,3.600000,8,3.375000,Met,Yes
18,1,1093141,9945214896,Cruz,Juan Elias,12,I,7,3.714286,8,3.750000,Met,Yes
19,1,1093177,9979703302,Cruz Ceja,Jesceli,12,R,7,3.428571,8,4.000000,Met,Yes
20,1,1093356,8008056775,De Luna,Kristian,12,R,7,4.000000,8,3.750000,Met,Yes
21,1,1093174,8384113214,Devera,Ethan,12,E,7,3.142857,8,4.000000,Met,Yes
22,1,1095228,1522488295,Espinoza,Leslli,12,R,7,3.285714,8,3.625000,Met,Yes
24,8,1093494,4022762449,Felix Lopez,Anna,12,R,5,4.000000,8,4.000000,Met,Yes
25,1,1093201,7424722787,Garcia,Nenet,12,E,7,3.285714,8,4.000000,Met,Yes
26,1,1095217,9165287788,Gudino Rosas,Carlin,12,R,7,3.857143,8,4.000000,Met,Yes
27,8,1095046,5578393320,Guerrero Marin,Perlita,12,R,6,3.333333,8,2.750000,Met,Yes
28,8,1093496,5017425006,Guevara,Darylene,12,R,5,4.000000,8,2.750000,Met,Yes
29,1,1094401,9060039663,Hardman,Desmond,12,E,7,4.000000,8,4.000000,Met,Yes
30,1,1093544,9709226910,Herrera Heredia,Karen,12,R,7,4.000000,8,4.000000,Met,Yes
32,1,1093179,9480522431,Jaime,Skyelynn,12,E,7,3.857143,8,3.750000,Met,Yes
33,8,1093569,2130707002,Jimenez Martinez,Roxanna,12,R,6,3.333333,8,2.500000,Met,Yes
34,8,1093651,3079416712,Juarez,Melissa,12,R,5,4.000000,8,4.000000,Met,Yes
37,8,1093657,8278194669,Lopez Rondan,Aaron,12,R,6,4.000000,8,3.750000,Met,Yes
38,1,1095230,6464274513,Madriz LÃ³pez,Maricarmen,12,R,7,3.428571,7,3.285714,Met,Yes
40,8,1093570,4467358383,Martinez Diaz,Maria,12,L,5,3.800000,8,3.000000,Met,Yes
41,1,1094658,7557588055,Mendoza Carranza,Galilea,12,R,7,3.428571,8,3.750000,Met,Yes
42,1,1093183,8566147967,Monroy,Gabriela,12,R,7,3.428571,8,3.625000,Met,Yes
44,8,1095593,6177610326,Moreno,Leslie,12,R,5,3.600000,8,3.125000,Met,Yes
46,1,1093184,2390419451,Negrete,Jocelyn,12,R,7,3.714286,8,4.000000,Met,Yes
47,8,1093652,8367430397,Negrete Garcia,Juan,12,R,5,3.600000,8,3.375000,Met,Yes
48,1,1093512,8138838780,Nunez,Celeste,12,R,7,3.285714,8,3.500000,Met,Yes
49,1,1093186,2387194176,Ochoa,Diego,12,R,7,3.285714,8,3.625000,Met,Yes
51,1,1093185,5781604926,Otero,Stephanie,12,R,7,3.571429,8,3.875000,Met,Yes
53,8,1095245,2745575537,Palacios,Perla,12,R,7,4.000000,6,3.833333,Met,Yes
54,1,1093671,9007097297,Pena,Nayely,12,R,7,3.571429,8,3.750000,Met,Yes
56,1,1093215,4619468621,Pimentel,Aubrey,12,E,7,3.285714,8,3.750000,Met,Yes
58,1,1093157,5177026517,Ramirez,Natalia,12,I,7,3.428571,8,3.875000,Met,Yes
59,8,1095942,9953526892,Rangel Flores,Nancy,12,R,7,3.571429,7,3.285714,Met,Yes
60,1,1093159,1650536212,Rodriguez Lopez,Alicia,12,R,7,4.000000,8,4.000000,Met,Yes
62,1,1093786,6190315356,Romano Angel,Carlos,12,R,7,3.571429,8,3.625000,Met,Yes
63,1,1095234,7046740484,Ruiz,Sebastian,12,E,7,3.285714,8,3.500000,Met,Yes
65,1,1093691,5161026802,Salas,Patricio,12,R,5,3.200000,7,3.571429,Met,Yes
67,1,1093784,4751049881,Sanchez Mejia,Alondra,12,R,7,4.000000,8,4.000000,Met,Yes
71,1,1093838,3018705052,Trejo,Emilly,12,R,5,3.000000,7,3.285714,Met,Yes
72,8,1093655,7900207435,Valenzuela,Diamonique,12,R,5,3.600000,8,3.375000,Met,Yes
73,1,1093196,4003857821,Vargas,Samuel,12,E,7,3.000000,8,3.375000,Met,Yes
74,1,1095102,1223497304,Vargas,Yanitzia,12,R,7,3.428571,8,4.000000,Met,Yes
75,8,1093656,6765392957,Zamudio Silva,Sara,12,R,6,3.666667,8,3.500000,Met,Yes

In [189]:
# Selects students who did not meet in SBAC
spanish_no_sbac = spanish_yes[spanish_yes['SBAC'] != 'Met']
spanish_no_sbac

,School,Student ID,State Student ID,Last Name,First Name,Grade,LangFlu,Spanish Semesters,Spanish GPA,ELA Semesters,ELA GPA,SBAC
15,1,1094023,8739597115,Correa,Miguel,12,R,7,3.571429,8,3.750000,Not Met
23,1,1094484,4532271208,Fajardo,Maria,12,L,5,3.800000,8,4.000000,Not Met
43,8,1094395,1319511273,Mora Zuniga,Cristal,12,R,6,3.500000,8,3.250000,Not Met
45,8,1093571,6468477568,Negrete,Angelique,12,R,6,3.500000,8,2.375000,Not Met
50,1,1095965,4942480713,Ontiveros Felix,Missael,12,R,3,3.666667,8,3.625000,Not Met
61,8,1095241,5022961290,Rojas Calderon,Deysy,12,R,6,4.000000,7,3.285714,Not Met
70,1,1093785,1270376673,Soto,Janelle,12,R,5,3.200000,8,3.625000,Not Met

In [190]:
# Selects students with above a 3.0 GPA in English
spanish_ela_yes = spanish_no_sbac[spanish_no_sbac['ELA GPA'] >= 3]
spanish_ela_yes

,School,Student ID,State Student ID,Last Name,First Name,Grade,LangFlu,Spanish Semesters,Spanish GPA,ELA Semesters,ELA GPA,SBAC
15,1,1094023,8739597115,Correa,Miguel,12,R,7,3.571429,8,3.750000,Not Met
23,1,1094484,4532271208,Fajardo,Maria,12,L,5,3.800000,8,4.000000,Not Met
43,8,1094395,1319511273,Mora Zuniga,Cristal,12,R,6,3.500000,8,3.250000,Not Met
50,1,1095965,4942480713,Ontiveros Felix,Missael,12,R,3,3.666667,8,3.625000,Not Met
61,8,1095241,5022961290,Rojas Calderon,Deysy,12,R,6,4.000000,7,3.285714,Not Met
70,1,1093785,1270376673,Soto,Janelle,12,R,5,3.200000,8,3.625000,Not Met

In [191]:
# Marks these students On Track
spanish_ela_yes['On Track'] = 'Yes'
spanish_ela_yes

C:\Users\DEREK~1.CAS\AppData\Local\Temp/ipykernel_19240/4014299192.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  spanish_ela_yes['On Track'] = 'Yes'

,School,Student ID,State Student ID,Last Name,First Name,Grade,LangFlu,Spanish Semesters,Spanish GPA,ELA Semesters,ELA GPA,SBAC,On Track
15,1,1094023,8739597115,Correa,Miguel,12,R,7,3.571429,8,3.750000,Not Met,Yes
23,1,1094484,4532271208,Fajardo,Maria,12,L,5,3.800000,8,4.000000,Not Met,Yes
43,8,1094395,1319511273,Mora Zuniga,Cristal,12,R,6,3.500000,8,3.250000,Not Met,Yes
50,1,1095965,4942480713,Ontiveros Felix,Missael,12,R,3,3.666667,8,3.625000,Not Met,Yes
61,8,1095241,5022961290,Rojas Calderon,Deysy,12,R,6,4.000000,7,3.285714,Not Met,Yes
70,1,1093785,1270376673,Soto,Janelle,12,R,5,3.200000,8,3.625000,Not Met,Yes

In [192]:
# Marks students with under a 3.0 GPA as being that way
spanish_ela_no = spanish_no_sbac[spanish_no_sbac['ELA GPA'] < 3]
spanish_ela_no

,School,Student ID,State Student ID,Last Name,First Name,Grade,LangFlu,Spanish Semesters,Spanish GPA,ELA Semesters,ELA GPA,SBAC
45,8,1093571,6468477568,Negrete,Angelique,12,R,6,3.5,8,2.375,Not Met

In [194]:
# These students are marked as not being on track
spanish_ela_no['On Track'] = 'No'
spanish_ela_no

C:\Users\DEREK~1.CAS\AppData\Local\Temp/ipykernel_19240/3722984940.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  spanish_ela_no['On Track'] = 'No'

,School,Student ID,State Student ID,Last Name,First Name,Grade,LangFlu,Spanish Semesters,Spanish GPA,ELA Semesters,ELA GPA,SBAC,On Track
45,8,1093571,6468477568,Negrete,Angelique,12,R,6,3.5,8,2.375,Not Met,No

In [195]:
# Puts together all of the student data once again
final = pd.concat([spanish_sbac, spanish_ela_yes, spanish_ela_no, spanish_no])
final

,School,Student ID,State Student ID,Last Name,First Name,Grade,LangFlu,Spanish Semesters,Spanish GPA,ELA Semesters,ELA GPA,SBAC,On Track
0,1,1095224,3322868264,Acevedo,Italivi,12,R,7,3.857143,8,4.000,Met,Yes
1,1,1095221,9742794671,Alvarado,Demetrio,12,R,7,3.714286,8,3.500,Met,Yes
2,8,1095242,1275231058,Anaya Avila,Jessenia,12,R,5,3.800000,8,4.000,Met,Yes
5,8,1093487,6103250605,Barboza,Andrik,12,R,5,4.000000,8,2.875,Met,Yes
6,8,1093488,5074689903,Bautista Martinez,Juan,12,R,6,3.166667,8,3.375,Met,Yes
...,...,...,...,...,...,...,...,...,...,...,...,...,...
57,1,1095219,7600509988,Ramirez,Clarissa,12,R,7,2.857143,8,3.250,Met,No
64,1,1095231,6019779701,Salas,Marina,12,R,7,2.857143,8,3.000,Met,No
66,1,1095094,8660014828,Sanchez,Alexis,12,R,5,2.600000,8,3.000,Not Met,No
68,1,1093193,9598723402,Santana,Blanca,12,R,5,2.600000,7,3.000,Not Met,No
69,1,1094021,2730343691,Silva Guzman,Laura,12,R,5,2.800000,8,3.000,Not Met,No

## EL Students

Students that are English Language Learners have another criteria that needs to be met and that is for them to have a 4 on the Speaking and Listening part of the ELPAC. Using the data from the Aeries Query the part (Part 1) of the ELPAC will be chosen and then looked at to determine if these students are on track or not.

In [196]:
final

,School,Student ID,State Student ID,Last Name,First Name,Grade,LangFlu,Spanish Semesters,Spanish GPA,ELA Semesters,ELA GPA,SBAC,On Track
0,1,1095224,3322868264,Acevedo,Italivi,12,R,7,3.857143,8,4.000,Met,Yes
1,1,1095221,9742794671,Alvarado,Demetrio,12,R,7,3.714286,8,3.500,Met,Yes
2,8,1095242,1275231058,Anaya Avila,Jessenia,12,R,5,3.800000,8,4.000,Met,Yes
5,8,1093487,6103250605,Barboza,Andrik,12,R,5,4.000000,8,2.875,Met,Yes
6,8,1093488,5074689903,Bautista Martinez,Juan,12,R,6,3.166667,8,3.375,Met,Yes
...,...,...,...,...,...,...,...,...,...,...,...,...,...
57,1,1095219,7600509988,Ramirez,Clarissa,12,R,7,2.857143,8,3.250,Met,No
64,1,1095231,6019779701,Salas,Marina,12,R,7,2.857143,8,3.000,Met,No
66,1,1095094,8660014828,Sanchez,Alexis,12,R,5,2.600000,8,3.000,Not Met,No
68,1,1093193,9598723402,Santana,Blanca,12,R,5,2.600000,7,3.000,Not Met,No
69,1,1094021,2730343691,Silva Guzman,Laura,12,R,5,2.800000,8,3.000,Not Met,No

In [197]:
# Selects non-EL students
non_el = final[final['LangFlu'] != 'L']
non_el

,School,Student ID,State Student ID,Last Name,First Name,Grade,LangFlu,Spanish Semesters,Spanish GPA,ELA Semesters,ELA GPA,SBAC,On Track
0,1,1095224,3322868264,Acevedo,Italivi,12,R,7,3.857143,8,4.000,Met,Yes
1,1,1095221,9742794671,Alvarado,Demetrio,12,R,7,3.714286,8,3.500,Met,Yes
2,8,1095242,1275231058,Anaya Avila,Jessenia,12,R,5,3.800000,8,4.000,Met,Yes
5,8,1093487,6103250605,Barboza,Andrik,12,R,5,4.000000,8,2.875,Met,Yes
6,8,1093488,5074689903,Bautista Martinez,Juan,12,R,6,3.166667,8,3.375,Met,Yes
...,...,...,...,...,...,...,...,...,...,...,...,...,...
57,1,1095219,7600509988,Ramirez,Clarissa,12,R,7,2.857143,8,3.250,Met,No
64,1,1095231,6019779701,Salas,Marina,12,R,7,2.857143,8,3.000,Met,No
66,1,1095094,8660014828,Sanchez,Alexis,12,R,5,2.600000,8,3.000,Not Met,No
68,1,1093193,9598723402,Santana,Blanca,12,R,5,2.600000,7,3.000,Not Met,No
69,1,1094021,2730343691,Silva Guzman,Laura,12,R,5,2.800000,8,3.000,Not Met,No

In [198]:
# Selects EL students
el = final[final['LangFlu'] == 'L']
el

,School,Student ID,State Student ID,Last Name,First Name,Grade,LangFlu,Spanish Semesters,Spanish GPA,ELA Semesters,ELA GPA,SBAC,On Track
40,8,1093570,4467358383,Martinez Diaz,Maria,12,L,5,3.8,8,3.000000,Met,Yes
23,1,1094484,4532271208,Fajardo,Maria,12,L,5,3.8,8,4.000000,Not Met,Yes
55,1,1093156,7344335935,Perez,Jonathan,12,L,5,2.8,7,3.714286,Not Met,No

In [199]:
elpac

       Student ID  TESTID  Part  PerformLvl  Date Taken
0         1095014   ELPAC   0.0         4.0  03/27/2019
1         1095014    SBAC   2.0         2.0  05/20/2021
2         1095014     MAP  20.0         0.0  08/31/2021
3         1095014     MAP   1.0         0.0  08/30/2021
4         1095014     MAP  20.0         0.0  12/06/2021
...           ...     ...   ...         ...         ...
99995     1094353     MAP   1.0         0.0  11/14/2022
99996     1094353  DIBELS   2.0         1.0  12/07/2022
99997     1094353     CFA   5.0         3.0  01/25/2023
99998     1094353     CFA   7.0         3.0  03/01/2023
99999     1094353     CFA   8.0         4.0  03/02/2023

[100000 rows x 5 columns]

In [200]:
# Selects ELPAC out of the tests
elpac = elpac[elpac['TESTID'] == 'ELPAC']
elpac

       Student ID TESTID  Part  PerformLvl  Date Taken
0         1095014  ELPAC   0.0         4.0  03/27/2019
175       1096128  ELPAC   0.0         2.0  02/06/2024
176       1096128  ELPAC   1.0         2.0  02/06/2024
177       1096128  ELPAC   2.0         1.0  02/06/2024
178       1096128  ELPAC   3.0         2.0  02/06/2024
...           ...    ...   ...         ...         ...
99983     1094353  ELPAC   2.0         2.0  02/17/2022
99984     1094353  ELPAC   3.0         2.0  02/11/2022
99985     1094353  ELPAC   4.0         2.0  02/17/2022
99986     1094353  ELPAC   5.0         2.0  02/11/2022
99987     1094353  ELPAC   6.0         2.0  02/01/2022

[18870 rows x 5 columns]

In [201]:
# Searches for the right part of the test
elpac = elpac[elpac['Part'] == 1]
elpac

       Student ID TESTID  Part  PerformLvl  Date Taken
176       1096128  ELPAC   1.0         2.0  02/06/2024
198       1093925  ELPAC   1.0         3.0  04/14/2021
214       1093925  ELPAC   1.0         4.0  02/03/2022
239       1093925  ELPAC   1.0         3.0  02/14/2023
261       1093925  ELPAC   1.0         3.0  02/22/2024
...           ...    ...   ...         ...         ...
99888     1094065  ELPAC   1.0         3.0  03/22/2019
99895     1094065  ELPAC   1.0         2.0  03/26/2021
99912     1094065  ELPAC   1.0         4.0  02/15/2022
99964     1094353  ELPAC   1.0         2.0  05/17/2021
99982     1094353  ELPAC   1.0         2.0  02/17/2022

[2716 rows x 5 columns]

In [202]:
elpac.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2716 entries, 176 to 99982
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Student ID  2716 non-null   int64
 1   TESTID      2716 non-null   object
 2   Part        2716 non-null   float64
 3   PerformLvl  2716 non-null   float64
 4   Date Taken  2716 non-null   object
dtypes: float64(2), int64(1), object(2)
memory usage: 127.3+ KB

In [203]:
# Changes date from a string into a datetime
elpac['Date Taken']= pd.to_datetime(elpac['Date Taken'])
elpac

C:\Users\DEREK~1.CAS\AppData\Local\Temp/ipykernel_19240/3959748886.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  elpac['Date Taken']= pd.to_datetime(elpac['Date Taken'])

       Student ID TESTID  Part  PerformLvl Date Taken
176       1096128  ELPAC   1.0         2.0 2024-02-06
198       1093925  ELPAC   1.0         3.0 2021-04-14
214       1093925  ELPAC   1.0         4.0 2022-02-03
239       1093925  ELPAC   1.0         3.0 2023-02-14
261       1093925  ELPAC   1.0         3.0 2024-02-22
...           ...    ...   ...         ...        ...
99888     1094065  ELPAC   1.0         3.0 2019-03-22
99895     1094065  ELPAC   1.0         2.0 2021-03-26
99912     1094065  ELPAC   1.0         4.0 2022-02-15
99964     1094353  ELPAC   1.0         2.0 2021-05-17
99982     1094353  ELPAC   1.0         2.0 2022-02-17

[2716 rows x 5 columns]

In [204]:
# Sorts by most recent date and down
elpac = elpac.sort_values(by=['Student ID' , 'Date Taken'], ascending=[False, False])
elpac

       Student ID TESTID  Part  PerformLvl Date Taken
38453     1096656  ELPAC   1.0         4.0 2022-02-10
38437     1096656  ELPAC   1.0         4.0 2021-04-21
38430     1096656  ELPAC   1.0         3.0 2019-04-22
50300     1096390  ELPAC   1.0         3.0 2024-03-07
52254     1096389  ELPAC   1.0         2.0 2024-02-14
...           ...    ...   ...         ...        ...
41583     1092314  ELPAC   1.0         3.0 2023-02-15
41558     1092314  ELPAC   1.0         3.0 2022-02-16
41538     1092314  ELPAC   1.0         3.0 2021-04-27
41531     1092314  ELPAC   1.0         3.0 2019-05-31
41524     1092314  ELPAC   1.0         4.0 2018-05-31

[2716 rows x 5 columns]

In [205]:
# Drops all duplicates and keeps the most recent test.
elpac = elpac.drop_duplicates(subset='Student ID', keep='first')
elpac

       Student ID TESTID  Part  PerformLvl Date Taken
38453     1096656  ELPAC   1.0         4.0 2022-02-10
50300     1096390  ELPAC   1.0         3.0 2024-03-07
52254     1096389  ELPAC   1.0         2.0 2024-02-14
52449     1096386  ELPAC   1.0         3.0 2024-02-23
3024      1096382  ELPAC   1.0         3.0 2024-02-28
...           ...    ...   ...         ...        ...
68447     1092334  ELPAC   1.0         4.0 2019-05-31
12770     1092332  ELPAC   1.0         4.0 2019-05-31
31702     1092327  ELPAC   1.0         4.0 2019-05-31
80945     1092319  ELPAC   1.0         4.0 2022-03-02
41608     1092314  ELPAC   1.0         3.0 2024-02-20

[851 rows x 5 columns]

In [206]:
# Narrows columns down
elpac = elpac[['Student ID', 'PerformLvl']]
elpac

       Student ID  PerformLvl
38453     1096656         4.0
50300     1096390         3.0
52254     1096389         2.0
52449     1096386         3.0
3024      1096382         3.0
...           ...         ...
68447     1092334         4.0
12770     1092332         4.0
31702     1092327         4.0
80945     1092319         4.0
41608     1092314         3.0

[851 rows x 2 columns]

In [207]:
# Renames columns
elpac = elpac.rename(columns={'PerformLvl': 'Oral Level'})
elpac

       Student ID  Oral Level
38453     1096656         4.0
50300     1096390         3.0
52254     1096389         2.0
52449     1096386         3.0
3024      1096382         3.0
...           ...         ...
68447     1092334         4.0
12770     1092332         4.0
31702     1092327         4.0
80945     1092319         4.0
41608     1092314         3.0

[851 rows x 2 columns]

In [208]:
el

,School,Student ID,State Student ID,Last Name,First Name,Grade,LangFlu,Spanish Semesters,Spanish GPA,ELA Semesters,ELA GPA,SBAC,On Track
40,8,1093570,4467358383,Martinez Diaz,Maria,12,L,5,3.8,8,3.000000,Met,Yes
23,1,1094484,4532271208,Fajardo,Maria,12,L,5,3.8,8,4.000000,Not Met,Yes
55,1,1093156,7344335935,Perez,Jonathan,12,L,5,2.8,7,3.714286,Not Met,No

In [209]:
# Merges test with chosen EL students
el = pd.merge(el, elpac, how='inner', on='Student ID')
el

,School,Student ID,State Student ID,Last Name,First Name,Grade,LangFlu,Spanish Semesters,Spanish GPA,ELA Semesters,ELA GPA,SBAC,On Track,Oral Level
0,8,1093570,4467358383,Martinez Diaz,Maria,12,L,5,3.8,8,3.000000,Met,Yes,3.0
1,1,1094484,4532271208,Fajardo,Maria,12,L,5,3.8,8,4.000000,Not Met,Yes,3.0
2,1,1093156,7344335935,Perez,Jonathan,12,L,5,2.8,7,3.714286,Not Met,No,4.0

In [212]:
el_on_track= el[el['On Track'] =='Yes']
el_on_track

,School,Student ID,State Student ID,Last Name,First Name,Grade,LangFlu,Spanish Semesters,Spanish GPA,ELA Semesters,ELA GPA,SBAC,On Track,Oral Level
0,8,1093570,4467358383,Martinez Diaz,Maria,12,L,5,3.8,8,3.0,Met,Yes,3.0
1,1,1094484,4532271208,Fajardo,Maria,12,L,5,3.8,8,4.0,Not Met,Yes,3.0

In [213]:
el_not_track= el[el['On Track'] =='No']
el_not_track

,School,Student ID,State Student ID,Last Name,First Name,Grade,LangFlu,Spanish Semesters,Spanish GPA,ELA Semesters,ELA GPA,SBAC,On Track,Oral Level
2,1,1093156,7344335935,Perez,Jonathan,12,L,5,2.8,7,3.714286,Not Met,No,4.0

In [214]:
passed_elpac = el_on_track[el_on_track['Oral Level'] >=4]
passed_elpac['On Track'] = 'Yes'
passed_elpac

,School,Student ID,State Student ID,Last Name,First Name,Grade,LangFlu,Spanish Semesters,Spanish GPA,ELA Semesters,ELA GPA,SBAC,On Track,Oral Level
0,8,1093570,4467358383,Martinez Diaz,Maria,12,L,5,3.8,8,3.0,Met,Yes,3.0
1,1,1094484,4532271208,Fajardo,Maria,12,L,5,3.8,8,4.0,Not Met,Yes,3.0

In [215]:
failed_elpac = el_on_track[el_on_track['Oral Level'] <3]
failed_elpac['On Track'] = 'No'
failed_elpac

Empty DataFrame
Columns: [School, Student ID, State Student ID, Last Name, First Name, Grade, LangFlu, Spanish Semesters, Spanish GPA, ELA Semesters, ELA GPA, SBAC, On Track, Oral Level]
Index: []

In [216]:
el = pd.concat([passed_elpac, failed_elpac, el_not_track])
el

,School,Student ID,State Student ID,Last Name,First Name,Grade,LangFlu,Spanish Semesters,Spanish GPA,ELA Semesters,ELA GPA,SBAC,On Track,Oral Level
0,8,1093570,4467358383,Martinez Diaz,Maria,12,L,5,3.8,8,3.000000,Met,Yes,3.0
1,1,1094484,4532271208,Fajardo,Maria,12,L,5,3.8,8,4.000000,Not Met,Yes,3.0
2,1,1093156,7344335935,Perez,Jonathan,12,L,5,2.8,7,3.714286,Not Met,No,4.0

In [217]:
final = pd.concat([non_el, el])
final

,School,Student ID,State Student ID,Last Name,First Name,Grade,LangFlu,Spanish Semesters,Spanish GPA,ELA Semesters,ELA GPA,SBAC,On Track,Oral Level
0,1,1095224,3322868264,Acevedo,Italivi,12,R,7,3.857143,8,4.000000,Met,Yes,NaN
1,1,1095221,9742794671,Alvarado,Demetrio,12,R,7,3.714286,8,3.500000,Met,Yes,NaN
2,8,1095242,1275231058,Anaya Avila,Jessenia,12,R,5,3.800000,8,4.000000,Met,Yes,NaN
5,8,1093487,6103250605,Barboza,Andrik,12,R,5,4.000000,8,2.875000,Met,Yes,NaN
6,8,1093488,5074689903,Bautista Martinez,Juan,12,R,6,3.166667,8,3.375000,Met,Yes,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
68,1,1093193,9598723402,Santana,Blanca,12,R,5,2.600000,7,3.000000,Not Met,No,NaN
69,1,1094021,2730343691,Silva Guzman,Laura,12,R,5,2.800000,8,3.000000,Not Met,No,NaN
0,8,1093570,4467358383,Martinez Diaz,Maria,12,L,5,3.800000,8,3.000000,Met,Yes,3.0
1,1,1094484,4532271208,Fajardo,Maria,12,L,5,3.800000,8,4.000000,Not Met,Yes,3.0
2,1,1093156,7344335935,Perez,Jonathan,12,L,5,2.800000,7,3.714286,Not Met,No,4.0

In [218]:
column_to_move = final.pop('On Track')
final['On Track'] = column_to_move
final

,School,Student ID,State Student ID,Last Name,First Name,Grade,LangFlu,Spanish Semesters,Spanish GPA,ELA Semesters,ELA GPA,SBAC,Oral Level,On Track
0,1,1095224,3322868264,Acevedo,Italivi,12,R,7,3.857143,8,4.000000,Met,NaN,Yes
1,1,1095221,9742794671,Alvarado,Demetrio,12,R,7,3.714286,8,3.500000,Met,NaN,Yes
2,8,1095242,1275231058,Anaya Avila,Jessenia,12,R,5,3.800000,8,4.000000,Met,NaN,Yes
5,8,1093487,6103250605,Barboza,Andrik,12,R,5,4.000000,8,2.875000,Met,NaN,Yes
6,8,1093488,5074689903,Bautista Martinez,Juan,12,R,6,3.166667,8,3.375000,Met,NaN,Yes
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
68,1,1093193,9598723402,Santana,Blanca,12,R,5,2.600000,7,3.000000,Not Met,NaN,No
69,1,1094021,2730343691,Silva Guzman,Laura,12,R,5,2.800000,8,3.000000,Not Met,NaN,No
0,8,1093570,4467358383,Martinez Diaz,Maria,12,L,5,3.800000,8,3.000000,Met,3.0,Yes
1,1,1094484,4532271208,Fajardo,Maria,12,L,5,3.800000,8,4.000000,Not Met,3.0,Yes
2,1,1093156,7344335935,Perez,Jonathan,12,L,5,2.800000,7,3.714286,Not Met,4.0,No

In [219]:
import base64
from IPython.display import HTML

def create_download_link( df, title = "Biliteracy", filename = "Biliteracy"):
    csv = df.to_csv()
    b64 = base64.b64encode(csv.encode())
    payload = b64.decode()
    html = '<a download="{filename}" href="data:text/csv;base64,{payload}" target="_blank">{title}</a>'
    html = html.format(payload=payload,title=title,filename=filename)
    return HTML(html)

create_download_link(final)